// let dataList = [
// {
// 	title: '《枫桥夜泊》 唐·张继',
// 	 content : '《枫桥夜泊》是唐代诗人张继创作的一首诗，描写了诗人在寒山寺外夜泊时的感受，抒发了诗人旅途中的愁绪。',
//       poem : '月落乌啼霜满天，江枫渔火对愁眠。姑苏城外寒山寺，夜半钟声到客船。',
//       notes : [
//         '1. 乌啼：乌鸦啼叫。',
//         '2. 对愁眠：对着满怀愁绪而睡。',
//         '3. 寒山寺：位于今苏州。',
//         '4. 客船：旅客的船。',
//       ],
//       lines : [
//         { text: '月落乌啼霜满天，', pinyin: 'yuè luò wū tí shuāng mǎn tiān,' },
//         { text: '江枫渔火对愁眠。', pinyin: 'jiāng fēng yú huǒ duì chóu mián。' },
//         { text: '姑苏城外寒山寺，', pinyin: 'gū sū chéng wài hán shān sì,' },
//         { text: '夜半钟声到客船。', pinyin: 'yè bàn zhōng shēng dào kè chuán。' },
//       ],
//       judgementQuestions : [
//         '“霜满天”既是诗人真实的感受又是他亲眼所见的景象。（    ）',
//         '“对愁眠”的意思是对着忧愁无奈地入睡。（    ）'
//     ],
//     	judgementAnsList: [false, false],
//     multipleChoiceQuestions : [
//         {
//             question: '这首诗的意象众多，其中成为苏州的“名片”的两个意象是             。',
//             options: [
//                 'A. 江枫 / 寒山寺',
//                 'B. 江枫 / 渔火',
//                 'C. 枫桥 / 寒山寺',
//                 'D. 枫桥 / 渔火'
//             ],
//             correctIndex: 2
//         },
//         {
//             question: '下面对“姑苏城外寒山寺，夜半钟声到客船”理解正确的是     。',
//             options: [
//                 'A. 以乐景写哀情，用所见所闻表达心中的忧伤',
//                 'B. 情景交融，形成了一种幽远的意境',
//                 'C. 空灵的钟声衬托了夜晚的安静',
//                 'D. 蕴含着旅途中不尽的愁思'
//             ],
//             type: 'many',
//             correctIndics: [1,2,3]

//         }
//     ]
// },

// ]
/* let dataList = [
  {
    group: "regional",
    subGroup: "Jiangnan",
    title: "《敕勒歌》北朝民歌",
    content:
      "北朝民歌主要是指5-6世纪期间用汉语记录的北方歌谣，这些歌谣风格豪放，抒情率直，语言质朴，表现了北方民族英勇豪迈的气概。这首《敕勒歌》就是一首典型的北朝民歌，最早见于宋朝郭茂倩所编写的《乐府诗集》。",
    poem: "敕勒川，阴山下。天似穹庐，笼盖四野。天苍苍，野茫茫，风吹草低见牛羊。",
    notes: [
      "1. 敕勒川：古代敕勒族居住的地方，在今天的内蒙古一带。",
      "2. 阴山：内蒙古的一座山脉。",
      "3. 穹庐：用布搭成的帐篷，即蒙古包。",
      "4. 笼盖：笼罩、覆盖。",
      "5. 苍苍：青色。",
      "6. 茫茫：辽阔无边的样子。",
      "7. 见：通“现”，显现。",
    ],
    lines: [
      { text: "敕勒川，阴山下，", pinyin: "chì lè chuān，yīn shān xià，" },
      {
        text: "天似穹庐，笼盖四野。",
        pinyin: "tiān sì qióng lú，lǒng gài sì yǎ。",
      },
      { text: "天苍苍，野茫茫，", pinyin: "tiān cāng cāng，yě máng máng，" },
      { text: "风吹草低见牛羊。", pinyin: "fēng chuī cǎo dī xiàn niú yáng。" },
    ],
    judgementQuestions: [
      "这首北方民歌，意境雄浑开阔，凸显了北方民族温婉的性格。（    ）",
      "“敕勒川，阴山下” 以阴山作为背景，对风景进行了细节描写。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question:
          "从细处着眼，画面生动形象，具有很强的视觉效果的诗句是____________。",
        options: [
          "A. 敕勒川，阴山下",
          "B. 天似穹庐，笼罩四野",
          "C. 天苍苍，野茫茫",
          "D. 风吹草低见牛羊",
        ],
        correctIndex: 3,
      },
      {
        question: "“天似穹庐”使用了______修辞手法，把_______想象成_______。",
        options: [
          "A. 拟人 / 天空 / 蒙古包",
          "B. 拟人 / 蒙古包 / 天空",
          "C. 比喻 / 天空 / 蒙古包",
          "D. 比喻 / 蒙古 / 包天空",
        ],
        correctIndex: 2,
      },
    ],
    judgementAnsList: [false, false],
  },
]; */

/* let dataList = [
  {
    group: "region",
    subGroup: "江南",
    title: "《寄扬州韩绰判官》唐·杜牧",
    content:
      "833年-835年，杜牧在扬州做官，和韩绰相识并成为好友。这首诗是杜牧离开扬州以后，怀念昔日友人韩绰而作。",
    poem: "青山隐隐水迢迢，秋尽江南草未凋。二十四桥明月夜，玉人何处教吹箫？",
    notes: [
      "1. 判官：唐代一种官职的名称，当时时韩绰任淮南节度使判官。",
      "2. 隐隐：不清晰、不明显的样子。迢迢：悠长。",
      "3. 尽：结束。凋：凋谢。",
      "4. 二十四桥：传说隋炀帝时期，有24个美人月夜在桥上吹箫，因此得名“二十四美人桥”，简称“二十四桥”或“廿四桥”；诗中用此桥来泛指扬州的众多小桥。",
      "5. 玉人：貌美之人，这里是杜牧对韩绰的戏称。教：使，令。",
    ],
    lines: [
      {
        text: "青山隐隐水迢迢，",
        pinyin: "qīng shān yǐn yǐn shuǐ tiáo tiáo，",
      },
      { text: "秋尽江南草未凋。", pinyin: "qiū jìn jiāng nán cǎo wèi diāo。" },
      { text: "二十四桥明月夜，", pinyin: "èr shí sì qiáo míng yuè yè，" },
      { text: "玉人何处教吹箫？", pinyin: "yù rén hé chù jiào chuī xiāo？" },
    ],
    judgementQuestions: [
      "“二十四桥明月夜，玉人何处教吹箫”是诗人看到的真实场景。（    ）",
      "这首诗既描写了江南的风景又蕴含着对友人的怀念。（    ）",
    ],
    judgementAnsList: [false, true],
    multipleChoiceQuestions: [
      {
        question: "“玉人”是指_______,这里是杜牧对     的戏称。",
        options: [
          "A. 职位高的人 / 韩绰",
          "B. 职位高的人 / 亲兄弟",
          "C. 貌美之人 / 韩绰",
          "D. 貌美之人 / 亲兄弟",
        ],
        correctIndex: 1,
      },
      {
        question:
          "“青山隐隐水迢迢，秋尽江南草未凋”这两句诗中“隐隐”与“迢迢”的使用效果是           。（可多选）",
        options: [
          "A. 渲染了伤感的情绪与氛围",
          "B. 刻画了江南青山绿水的画面",
          "C. 暗含诗人与友人距离遥远",
          "D. 表达了无法与好友见面的遗憾",
        ],
        correctIndics: [1, 2],
        type: "many",
      },
    ],
  },

  {
    title: "登鹳雀楼（唐）王之涣",
    group: "region",
    subGroup: "中原",
    content:
      "《登鹳雀楼》是唐代诗人王之涣创作的一首边塞诗，通过描写登高望远的景象，表现了诗人积极向上的人生态度。",
    poem: "白日依山尽，黄河入海流。欲穷千里目，更上一层楼。",
    notes: [
      "1. 鹳雀楼：位于山西省永济市，是古代的一座名楼。",
      "2. 依：靠近。",
      "3. 尽：消失，落下。",
      "4. 穷：穷尽，达到极点。",
    ],
    lines: [
      { text: "白日依山尽，", pinyin: "bái rì yī shān jìn," },
      { text: "黄河入海流。", pinyin: "huáng hé rù hǎi liú。" },
      { text: "欲穷千里目，", pinyin: "yù qióng qiān lǐ mù," },
      { text: "更上一层楼。", pinyin: "gèng shàng yī céng lóu。" },
    ],
  },
  {
    group: "region",
    subGroup: "川鄂",
    title: "《黄鹤楼》唐·崔颢",
    content:
      "《黄鹤楼》是唐代诗人崔颢创作的一首登楼望远之作，表达了诗人对历史、人生的感慨。",
    poem: "昔人已乘黄鹤去，此地空余黄鹤楼。黄鹤一去不复返，白云千载空悠悠。",
    notes: [
      "1. 昔人：指传说中的仙人。",
      "2. 黄鹤：传说中的神仙骑鹤。",
      "3. 悠悠：形容时间的长久。",
      "4. 千载：千年。",
    ],
    lines: [
      { text: "昔人已乘黄鹤去，", pinyin: "xī rén yǐ chéng huáng hè qù," },
      { text: "此地空余黄鹤楼。", pinyin: "cǐ dì kōng yú huáng hè lóu。" },
      { text: "黄鹤一去不复返，", pinyin: "huáng hè yī qù bù fù fǎn," },
      { text: "白云千载空悠悠。", pinyin: "bái yún qiān zǎi kōng yōu yōu。" },
    ],
    judgementQuestions: [
      "这首诗是一首七言律诗，李白读过之后认为崔颢这首诗写得不够好。（    ）",
      "“黄鹤一去不复返，白云千载空悠悠”描写的是白云衬托下江天相接的远景，这是诗人梦中所见。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question: "这首诗中诗人的“愁”是____________。",
        options: [
          "A. 政治失意之愁",
          "B. 忧国忧民之愁",
          "C. 思念家乡之愁",
          "D. 恋情失败之愁",
        ],
        correctIndex: 2,
      },
      {
        question:
          "下面关于“晴川历历汉阳树，芳草萋萋鹦鹉洲”理解正确的是______。（可多选）",
        options: [
          "A. 描写的是阳光下长江的明朗日景",
          "B. 是关于当地虚幻传说中的景色",
          "C. “晴川”与“芳草”对仗",
          "D. 引发下文中登楼远眺的愁绪",
        ],
        type: "many",
        correctIndics: [0, 3],
      },
    ],
    judgementAnsList: [false, false],
  },
  {
    group: "region",
    subGroup: "川鄂",
    judgementAnsList: [false, false],
    title: "《蜀相》唐·杜甫",
    content:
      "这首诗是杜甫在晚年漫游蜀地时，参拜成都武侯祠有感而发，怀念蜀汉丞相诸葛亮的功绩和悲剧性命运。",
    poem: "丞相祠堂何处寻，锦官城外柏森森。映阶碧草自春色，隔叶黄鹂空好音。三顾频烦天下计，两朝开济老臣心。出师未捷身先死，长使英雄泪满襟。",
    notes: [
      "1. 丞相：指代诸葛亮。祠堂：用来祭祀先祖或者先贤的场所，这里指武侯祠。武侯祠在今四川省成都市，是纪念三国时期蜀国丞相诸葛亮的祠堂，因为诸葛亮曾被封为武乡侯而得名。",
      "2. 锦官城：成都。因为成都以蜀锦闻名，为了保护和管理蜀锦生产，古代专门设立了“锦官”这一官职。森森：茂密的样子。",
      "3. 映阶：映照着台阶。",
      "4. 三顾：化用“三顾茅庐”的典故。频烦：同“频繁”，多次。",
      "5. 两朝开济：意思是诸葛亮曾经辅佐刘备与刘禅两代君主，辅助前者开创蜀国，辅佐后者治理蜀国。两朝：刘备与刘禅两代君主。开：开创。济：扶助。",
      "6. 出师：带领军队出征打仗。捷：胜利。",
      "7. 襟：衣领。",
    ],
    lines: [
      { text: "丞相祠堂何处寻，", pinyin: "chéng xiàng cí táng hé chù xún，" },
      { text: "锦官城外柏森森。", pinyin: "jǐn guān chéng wài bǎi sēn sēn。" },
      { text: "映阶碧草自春色，", pinyin: "yìng jiē bì cǎo zì chūn sè，" },
      { text: "隔叶黄鹂空好音。", pinyin: "gé yè huáng lí kōng hǎo yīn。" },
      { text: "三顾频烦天下计，", pinyin: "sān gù pín fán tiān xià jì，" },
      { text: "两朝开济老臣心。", pinyin: "liǎng cháo kāi jì lǎo chén xīn。" },
      { text: "出师未捷身先死，", pinyin: "chū shī wèi jié shēn xiān sǐ，" },
      {
        text: "长使英雄泪满襟。",
        pinyin: "cháng shǐ yīng xióng lèi mǎn jīn。",
      },
    ],
    judgementQuestions: [
      "这一次诗人到武侯祠并非专程前往，而是偶然来到这里的。（    ）",
      "“锦官城外柏森森”中的“森森”的意思是茂密的样子，用来营造一种愉快惬意的氛围。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question:
          "下面关于“映阶碧草自春色，隔叶黄鹂空好音”理解不正确的是____。（可多选）",
        options: [
          "A. 生动地描绘了武侯祠的春色。",
          "B. 诗人由自然界的春天联想到国家的中兴。",
          "C. “自春色”“空好音”是不带感情色彩的客观描写。",
          "D. 色彩鲜明，动静结合，没有哀伤之情。",
        ],
        correctIndics: [0, 1],
      },
      {
        question: "“三顾频烦天下计，两朝开济老臣心”暗含的历史典故是________。",
        options: [
          "A. 诸葛亮三气周瑜",
          "B. 刘关张桃园三结义",
          "C. 刘备三次请诸葛亮出山",
          "D. 陶谦三次让徐州给刘备",
        ],
        correctIndex: 2,
      },
    ],
  },
  {
    title: "《望庐山瀑布》唐·李白",
    content:
      "《望庐山瀑布》是唐代诗人李白创作的一首五言绝句，描写了庐山瀑布壮观的景象，表达了诗人对大自然的崇敬之情。",
    poem: "日照香炉生紫烟，遥看瀑布挂前川。飞流直下三千尺，疑是银河落九天。",
    notes: [
      "1. 香炉：指庐山香炉峰。",
      "2. 紫烟：因日光照射而产生的雾气。",
      "3. 川：河流。",
      "4. 银河：天上的银河。",
    ],
    lines: [
      { text: "日照香炉生紫烟，", pinyin: "rì zhào xiāng lú shēng zǐ yān," },
      { text: "遥看瀑布挂前川。", pinyin: "yáo kàn pù bù guà qián chuān。" },
      { text: "飞流直下三千尺，", pinyin: "fēi liú zhí xià sān qiān chǐ," },
      { text: "疑是银河落九天。", pinyin: "yí shì yín hé luò jiǔ tiān。" },
    ],
  },
  {
    group: "region",
    subGroup: "边疆",
    title: "《使至塞上》唐·王维",
    content:
      "737年，唐朝在与吐蕃的战争中获胜，唐玄宗命王维到边塞慰问将士，并且访查军情。这首诗就创作于此次出塞途中，记述了诗人行程的所见所感。",
    poem: "单车欲问边，属国过居延。征蓬出汉塞，归雁入胡天。大漠孤烟直，长河落日圆。萧关逢候骑，都护在燕然。",
    notes: [
      "1. 使至塞上：奉命出使边塞。使：出使。",
      "2. 单车：一辆车，这里指轻车简从。问边：慰问守卫边关的官兵。",
      "3. 属国：汉代负责外交事务的官员，诗人在这里借此指自己。居延：地名，在今甘肃张掖县西北，当时远在西北边塞。",
      "4. 征蓬：随风远飞的蓬草。",
      "5. 萧关：古代的关名，故址在今宁夏固原东南。候骑：骑马的侦察兵。",
      "6. 都护：唐朝在西北边疆置安西、安北等六大都护府，长官称都护。燕然：古山名，今蒙古国杭爱山，这里指前线。",
    ],
    lines: [
      { text: "单车欲问边，", pinyin: "dān chē yù wèn biān，" },
      { text: "属国过居延。", pinyin: "shǔ guò guó jū yán。" },
      { text: "征蓬出汉塞，", pinyin: "zhēng péng chū hàn sài，" },
      { text: "归雁入胡天。", pinyin: "guī yàn rù hú tiān。" },
      { text: "大漠孤烟直，", pinyin: "dà mó gū yān zhí，" },
      { text: "长河落日圆。", pinyin: "cháng hé luó rì yuán。" },
      { text: "萧关逢候骑，", pinyin: "xiāo guān féng hòu jì，" },
      { text: "都护在燕然。", pinyin: "dū hù zài yàn rán。" },
    ],
    judgementQuestions: [
      "这首诗就创作于出塞途中，记述了诗人行程的所见所感，场面十分热闹。（    ）",
      "颈联对仗十分工整，其中“孤烟”对“长河”。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question: "按诗歌的内容分类，这首诗属于_________。",
        options: ["A. 咏物诗", "B. 边塞诗", "C. 送别诗", "D. 田园诗"],
        correctIndex: 1,
      },
      {
        question:
          "“征蓬出汉塞，归雁入胡天”，由景生情，运用了___的修辞手法，侧面表达了其内心的_________。",
        options: [
          "A. 拟人 / 思乡之情",
          "B. 夸张 / 喜悦愉快",
          "C. 比喻 / 愤愤不平",
          "D. 排比 / 失落无奈",
        ],
        correctIndex: 2,
      },
    ],
    judgementAnsList: [false, false],
  },
  {
    title: "《望岳》唐·杜甫",
    content:
      "736年，杜甫开始漫游齐、赵、燕、鲁（今河南、河北、山东等地），这首诗就是在途中所作。",
    poem: "岱宗夫如何？齐鲁青未了。造化钟神秀，阴阳割昏晓。荡胸生层云，决眦入归鸟。会当凌绝顶，一览众山小。",
    notes: [
      "1. 岱宗：对泰山的尊称。泰山又名岱山，在今山东省泰安市，古代以泰山为五岳之首，诸山所宗，所以又称“岱宗”。夫：语气词，强调疑问语气。",
      "2. 齐鲁：春秋时期的齐国和鲁国，泰山是两国的分界。青：青翠的山色。未了：没有尽头。",
      "3. 造化：大自然的景物。钟：聚集。神秀：神奇秀美。",
      "4. 阴阳：山北是阴，山南是阳，这里指泰山的山北与山南。割：分割，分开。昏晓：黄昏和清晨。",
      "5. 荡胸：令人胸怀激荡。",
      "6. 决眦：形容极力张大眼睛的样子。眦：眼角。决：裂开。入：收入眼中。",
      "7. 会当：一定要。凌：登上。绝顶：山顶。",
      "8. 小：以……为小，认为……小。",
    ],
    lines: [
      { text: "岱宗夫如何？", pinyin: "dài zōng fú rú hé？" },
      { text: "齐鲁青未了。", pinyin: "qí lǔ qīng wèi liǎo。" },
      { text: "造化钟神秀，", pinyin: "zào huà zhōng shén xiù，" },
      { text: "阴阳割昏晓。", pinyin: "yīn yáng gē hūn xiǎo。" },
      { text: "荡胸生层云，", pinyin: "dàng xiōng shēng céng yún，" },
      { text: "决眦入归鸟。", pinyin: "jué zì rù guī niǎo。" },
      { text: "会当凌绝顶，", pinyin: "huì dāng líng jué dǐng，" },
      { text: "一览众山小。", pinyin: "yì lǎn zhòng shān xiǎo。" },
    ],
    judgementQuestions: [
      "“岱宗夫如何？齐鲁青未了”中“岱宗”指的是泰山，这两句诗使用了反问的修辞手法。（    ）",
      "山南是阳，山北是阴，“阴阳”诗中用来指的是泰山的山南与山北。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question: "________生动地体现了诗人使劲睁大眼睛观赏美景的样子。",
        options: [
          "A. 齐鲁青未了",
          "B. 造化钟神秀",
          "C. 荡胸生层云",
          "D. 决眦入归鸟",
        ],
      },
      {
        question: "下面关于“阴阳割昏晓”正确的理解是___________。（可多选）",
        options: [
          "A. 表现了泰山的高峻雄伟",
          "B. 在诗人看来泰山好像能主宰天色",
          "C. 细致的近望泰山时候所见",
          "D. 使用了比喻的修辞手法",
        ],
      },
    ],
  },
]; */
/* let dataList = 
[

  {
        group: "festival",
    subGroup: "春节与元夕",
         title :'《元日》宋·王安石',

      content : '这首诗创作于王安石刚刚担任丞相之时，面对当时宋王朝严重的社会危机，他上书皇帝主张变法改革。新年的时候，王安石见到家家户户都忙着准备过春节，联想到变法开始的新气象，有感而发，创作了此诗。因此，诗作充满热闹欢快的节日气氛及积极向上的奋发精神。',
      poem : '爆竹声中一岁除，春风送暖入屠苏。千门万户曈曈日，总把新桃换旧符。',
      notes : [
        '1. 元日：元的意思是始，元日就是初始之日，一般指农历正月初一，即中国传统节日春节，有贴对联、贴门神、吃饺子、吃年糕、放鞭炮、逛庙会等习俗。',
        '2. 除：逝去。',
        '3. 屠苏：屠苏酒，中国古代春节时全家合饮的一种酒，又名岁酒。',
        '4. 千门万户：形容人户众多。曈曈：太阳出来时光亮温暖的样子。',
        '5. 桃符：中国古代挂在大门上的两块画着门神样子或写着门神名字的桃木板。',
      ],
      lines : [
        { text: '爆竹声中一岁除，', pinyin: 'bào zhú shēng zhōng yí suì chú，' },
        { text: '春风送暖入屠苏。', pinyin: 'chūn fēng sóng nuǎn rù tú sū。' },
        { text: '千门万户曈曈日，', pinyin: 'qiān mén wàn hù tòng tòng rì，' },
        { text: '总把新桃换旧符。', pinyin: 'zǒng bǎ xīn táo huàn jiù fú。' },
      ],
      judgementQuestions : [
        '因为王安石刚刚被贬官离职，所以这首诗的感情基调是悲伤哀愁。（    ）',
        '“爆竹声中一岁除”中的“除”的意思是逝去。（    ）'
    ],
    multipleChoiceQuestions : [
        {
            question: '“千门万户曈曈日”写旭日的光辉普照千家万户，象征            。',
            options: [
                'A. 家家户户喜气洋洋', 
                'B. 无限光明美好的前景', 
                'C. 全家人都健康平安', 
                'D. 未来不再遇到困难'
            ],
            correctIndex: 1
        },
        {
            question: '下面关于“总把新桃换旧符”理解正确的是      。（可多选）',
            options: [
                'A. 呈现出万象更新的景象', 
                'B. 寄托着对改革成功的期待', 
                'C. 充满对新年的美好想象', 
                'D. 蕴含没落事物会被取代哲理'
            ],
            type: 'many',
            correctIndics:[0,1,3]
        }
    ],
      judgementAnsList: [false, true],    
    
    
    },
          {
              group: "festival",
    subGroup: "春节与元夕",
        judgementAnsList: [false, false],

        title: '《生查子·元夕》宋·欧阳修',
      content : '《生查子·元夕》是一首相思词，一般认为是欧阳修怀念他的第二任妻子杨氏夫人而创作的，通过主人公对去年今日的往事回忆，来抒写物是人非之感。生查子原来是唐代的一种教坊曲目，后来用作词的曲调。',
      poem : '去年元夜时，花市灯如昼。月上柳梢头，人约黄昏后。今年元夜时，月与灯依旧。不见去年人，泪湿春衫袖。',
      notes : [
        '1. 元夕：农历正月为元月，古人称夜晚为“宵”或“夕”，正月十五日的晚上称为元夕或者元宵，有观灯、猜灯谜、吃汤圆等习俗。',
        '2. 元夜：元宵节的夜晚。',
        '3. 花市：卖花、赏花的集市。灯如昼：灯火像白天一样。昼：白天。',
        '4. 泪湿：泪水湿透。',
        '5. 春衫：年少时穿的衣服，这里代指主人公自己。',
      ],
      lines : [
        { text: '去年元夜时，', pinyin: 'qù nián yuán yè shí，' },
        { text: '花市灯如昼。', pinyin: 'huā shì dēng rú zhóu。' },
        { text: '月上柳梢头，', pinyin: 'yuè shàng liǔ shāo tóu，' },
        { text: '人约黄昏后。', pinyin: 'rén yuē huáng hūn hóu。' },
        { text: '今年元夜时，', pinyin: 'jīn nián yuán yè shí，' },
        { text: '月与灯依旧。', pinyin: 'yuè yǔ dēng yī jiù。' },
        { text: '不见去年人，', pinyin: 'bú jiàn qù nián rén，' },
        { text: '泪湿春衫袖。', pinyin: 'lèi shī chūn shān xiù。' },
      ],
      judgementQuestions : [
        '这首词上阙描写今年元夕与恋人欢乐相会，下阙回忆去年未能见到恋人的痛苦。（    ）',
        '“花市灯如昼”的意思是花市被灯光照得如同白天一样明亮，“春衫”的意思是春天穿的衣服。（    ）'
    ],
    multipleChoiceQuestions : [
        {
             correctIndex: 1,
            question: '整首词中今与昔、苦与乐形成了鲜明的反差，使用了________的创作手法。',
            options: [
                'A. 想象', 
                'B. 对比', 
                'C. 白描', 
                'D. 比喻'
            ]
        },
        {
             correctIndex: 2,
            question: '下面关于“月上柳梢头，人约黄昏后”理解不正确的是_______。',
            options: [
                'A. 使用了情景交融的创作手法。',
                'B. 写出了月光与树影中的恋人形象',
                'C. 体现了对黄昏与恋人相见的期待',
                'D. 营造出朦胧柔美的意境'
            ]
        }
    ],
    
    },
             {
                 group: "festival",
    subGroup: "寒食与清明",
            title : '《寒食》唐·韩翃',
      content : '汉代的时候，皇帝在寒食节赏赐贵族蜡烛，准许他们照明，以示恩宠，寒食传烛示恩延续到唐代。唐代中期以后，几任皇帝都宠幸宦官，宦官在朝廷中的权力很大。韩翃在这首诗中，就是借寒食节民间禁火而权贵大臣们却可以破例点蜡烛，来含蓄地讽刺当时宦官专权的现象。',
      poem : '春城无处不飞花，寒食东风御柳斜。日暮汉宫传蜡烛，轻烟散入五侯家。',
      notes : [
        '1. 寒食：从春秋时期流传下来的一个传统节日，传说与介子推有关，在清明节前1-2天，习俗是三天禁止使用火、吃冷的食物，是比较少见的以饮食习俗来命名的节日。',
        '2. 春城：春天的长安城。',
        '3. 御柳：御苑的柳树，用来泛指皇城里的柳树。斜：（风把柳枝吹得）倾斜。',
        '4. 汉宫：代指唐朝皇宫。传蜡烛：寒食节禁止用火，但是权臣贵族却可以得到皇帝赏赐的蜡烛。',
        '5. 五侯：汉代成帝将他的5个舅舅封侯，后用“五侯”代指得到皇帝特别恩赏的权贵。',
      ],
      lines : [
        { text: '春城无处不飞花，', pinyin: 'chūn chéng wú chù bù fēi huā，' },
        { text: '寒食东风御柳斜。', pinyin: 'hán shí dōng fēng yù liǔ xiá。' },
        { text: '日暮汉宫传蜡烛，', pinyin: 'rì mù hàn gōng chuán là zhú，' },
        { text: '轻烟散入五侯家。', pinyin: 'qīng yān sàn rù wǔ hòu jiā。' },
      ],
      judgementQuestions : [
        '诗歌前两句写白天长安城的风光，后两句写黄昏后的景象，全诗呈现轻松愉快的氛围。（    ）',
        '寒食节的习俗有三天禁止使用火，吃冷的食物等。（    ）'
    ],
    judgementAnsList: [false, true],
    multipleChoiceQuestions : [
        {
            question: '这是一首      ，全诗使用      的手法。',
            options: [
                'A. 抒情诗 / 比喻', 
                'B. 抒情诗 / 白描', 
                'C. 讽喻诗 / 白描', 
                'D. 讽喻诗 / 比喻'
            ],
             correctIndex: 2,

 
        },
        {
            question: '下面关于“日暮汉宫传蜡烛，轻烟散入五侯家”的理解正确的是_______。（可多选）',
            options: [
                'A. 白描手法勾勒出一幅传烛图。',
                'B. “传”与“散”两个动词生动形象',
                'C. 仿佛能看见蜡烛熄灭时候飘起的轻烟',
                'D. 蕴含着诗人的讽刺'
            ],
             type: 'many',
            correctIndics:[1,2,3]
        }
    ]
    
    },
    {
		   group: "festival",
    subGroup: "寒食与清明",
      judgementAnsList:[false,false],
        title : '《清明》唐·杜牧',
      content : '据《江南通志》记载，杜牧在安徽池州做官的时候，曾经到过杏花村饮酒。当时朝廷党派斗争非常激烈，他也牵涉其中，从黄州调任池州，仕途不如意，有时候借酒浇愁，这首诗应该是他在清明时节游览池州杏花村所作。',
      poem : '清明时节雨纷纷，路上行人欲断魂。借问酒家何处有，牧童遥指杏花村。',
      notes : [
        '1. 清明：又称踏青节、祭祖节等，既是二十四节气之一，又是中国传统节日。这一天全家人一起扫墓祭祖，同时也亲近自然、踏青游玩，因此，扫墓祭祖与踏青郊游是清明节的两大习俗。',
        '2. 纷纷：形容多、密集。',
        '3. 欲：将要。断魂：形容伤心悲哀，好像失去魂魄一样。',
        '4. 借问：请问。',
        '5. 杏花村：杏花深处的村庄。',
      ],
      lines : [
        { text: '清明时节雨纷纷，', pinyin: 'qīng míng shí jiē yǔ fēn fēn，' },
        { text: '路上行人欲断魂。', pinyin: 'lù shàng xíng rén yù duàn hún。' },
        { text: '借问酒家何处有，', pinyin: 'jiè wèn jiǔ jiā hé chù yǒu，' },
        { text: '牧童遥指杏花村。', pinyin: 'mù tóng yáo zhǐ xìng huā cūn。' },
      ],
      judgementQuestions : [
        '这首诗是杜牧仕途顺利，离开家乡赴任途中创作的。（    ）',
        '“欲断魂”的意思是已经失去了魂魄，没有了意识。（    ）'
    ],
    multipleChoiceQuestions : [
        {
            question: '“清明时节雨纷纷”这句诗中“纷纷”的使用效果是      。（可多选）',
            options: [
                'A. 表现了春雨绵绵不绝的特点',
                'B. 凸显了对春雨的喜爱之情',
                'C. 用环境烘托行人愁苦的情绪',
                'D. 将行人匆匆赶路的样子写了出来'
            ],
             type: 'many',
            correctIndics:[0,2]
        },
        {
            question: '诗中“行人欲断魂”的原因是什么？（可多选）______',
            options: [
                'A. 孤身在外，心中忧伤。',
                'B. 听到了亲人离世的悲痛消息。',
                'C. 清明节又正好下雨，更加思念亲人。',
                'D. 与亲人相处得非常不愉快'
            ],
              type: 'many',
            correctIndics:[0,2]
        }
    ],    
    },
	    {
       group: "festival",
    subGroup: "端午与七夕",
        title : '《端午即事》宋·文天祥',
      content : '《端午即事》创作于1276年。这一年文天祥出使元军被扣压，在镇江逃脱后，出现了所谓元军派丞相到扬州劝他投降的谣言；在遭到误解的情况下，为了表明自己忠心报国的心志，文天祥写下了这首诗。',
      poem : '五月五日午，赠我一枝艾。故人不可见，新知万里外。丹心照夙昔，鬓发日已改。我欲从灵均，三湘隔辽海。',
      notes : [
        '1. 端午：中国传统节日，时间在农历五月初五，传说为纪念屈原而设立，又称端阳节、龙舟节等，有赛龙舟、吃粽子、挂艾草、戴五色丝线、喝雄黄酒、给儿童点雄黄酒等习俗。即事：根据眼前的事物、情景作诗文或绘画。',
        '2. 艾：艾草，古人认为艾草有避邪的作用，端午节把艾草挂在门上，用来辟邪消灾。',
        '3. 故人：老朋友。',
        '4. 新知：新结交的朋友。',
        '5. 丹心：报效国家的炽热之心。夙昔：早晚，用来比喻每天。',
        '6. 鬓发日已改：鬓发日渐变白，即变老。鬓发：耳边的头发。',
        '7. 灵均：屈原的字，屈原是战国时期楚国的政治家，也是伟大的爱国诗人，在楚国都城被秦军攻破后，他自沉于汨罗江，以身殉国。',
        '8. 三湘：湘江从上至下分别谓潇湘、资湘、沅湘，现在一般用来代指湖南。隔：间隔，距离。',
      ],
      lines : [
        { text: '五月五日午，', pinyin: 'wǔ yuè wǔ rì wǔ，' },
        { text: '赠我一枝艾。', pinyin: 'zèng wǒ yì zhī ài。' },
        { text: '故人不可见，', pinyin: 'gù rén bù kě jiàn，' },
        { text: '新知万里外。', pinyin: 'xīn zhī wàn lǐ wài。' },
        { text: '丹心照夙昔，', pinyin: 'dān xīn zhào sù xī，' },
        { text: '鬓发日已改。', pinyin: 'bìn fà rì yǐ gǎi。' },
        { text: '我欲从灵均，', pinyin: 'wǒ yù cóng líng jūn，' },
        { text: '三湘隔辽海。', pinyin: 'sān xiāng gé liáo hǎi。' },
      ],
      judgementQuestions : [
        '“端午即事”的意思是记录在端午节突然发生的一件事。（    ）',
        '这首诗专门用来表达对旧交与新知的怀念之情。（    ）'
    ],
    judgementAnsList:[false,false],
    multipleChoiceQuestions : [
        {
            question: '________是全诗的诗眼，是诗人________的写照。',
            options: [
                'A. 丹心  不被理解悲哀心情的写照',
                'B. 丹心  为国为民情愫的写照',
                'C. 夙昔  不被理解悲哀心情的写照',
                'D. 夙昔  为国为民情愫的写照'
            ],
             correctIndex: 1,

        },
        {
            question: '《端午即事》中“故人不可见，新知万里外”理解正确的一项是_____。',
            options: [
                'A. 表达了诗人对逝去故人的深切缅怀。',
                'B. 表达了诗人对老朋友离开自己的心酸。',
                'C. 抒发了与新老朋友都无法见面的苦闷。',
                'D. 抒发了对新朋友不理解自己的无奈。'
            ],
             correctIndex: 2,
        }
    ],    
    }
    , {
             group: "festival",
    subGroup: "端午与七夕",
        title : '《鹊桥仙·纤云弄巧》 宋·秦观',
      content : '秦观被贬谪的途中经过长沙，遇到了一位歌女，由于需要继续南下，不得不挥泪告别。到了郴州以后，他一直忘不了那位歌女，故而创作了这首词，借牛郎织女鹊桥相会，寄托深深思念。',
      poem : '纤云弄巧，飞星传恨，银汉迢迢暗度。金风玉露一相逢，便胜却人间无数。柔情似水，佳期如梦，忍顾鹊桥归路。两情若是久长时，又岂在朝朝暮暮。',
      notes : [
        '1. 纤云：轻薄的云彩。弄巧：这里指云彩在空中不停变化。',
        '2. 飞星：指牵牛星和织女星。恨：相思的愁苦。',
        '3. 银汉：银河。迢迢：形容遥远的样子。暗度：悄悄渡过。度：通“渡”。',
        '4. 金风：秋风。玉露：秋天的露水。',
        '5. 佳期：美好的时光。',
        '6. 忍顾：怎么忍心回头看。鹊桥：喜鹊搭成的桥。神话传说中，牛郎和织女因为被银河隔开无法相聚，每年农历七月初七，鸟神派喜鹊搭成桥，使牛郎和织女能在桥上见面。因此，七夕节从女儿节、乞巧节等逐渐演变成象征爱情的节日，在当代更是产生了“中国情人节”的文化含义。',
        '7. 朝朝暮暮：日日夜夜，指每一天。',
      ],
      lines : [
        { text: '纤云弄巧，', pinyin: 'xiān yún nóng qiǎo，' },
        { text: '飞星传恨，', pinyin: 'fēi xīng chuán hèn，' },
        { text: '银汉迢迢暗度。', pinyin: 'yín hàn tiáo tiáo àn dù。' },
        { text: '金风玉露一相逢，', pinyin: 'jīn fēng yù lù yì xiāng féng，' },
        { text: '便胜却人间无数。', pinyin: 'biàn shèng què rén jiān wú shù。' },
        { text: '柔情似水，', pinyin: 'ròu qíng sì shuǐ，' },
        { text: '佳期如梦，', pinyin: 'jiā qī rú mèng，' },
        { text: '忍顾鹊桥归路。', pinyin: 'rěn gù què qiáo guī lù。' },
        { text: '两情若是久长时，', pinyin: 'liǎng qíng ruò shì jiǔ chǎng shí，' },
        { text: '又岂在朝朝暮暮。', pinyin: 'yóu qǐ zài zhāo zhāo mù mù。' },
      ],
      judgementQuestions : [
        '“金风玉露一相逢”中以春风和雨露作为相会的美好背景，是爱情的高尚与纯洁的体现。（    ）',
        '“忍顾”意思是“怎么忍心”，直白地书写了无奈、心酸与不舍。（    ）'
    ],
    judgementAnsList:[false,true],
    multipleChoiceQuestions : [
        {
            question: '这首词的上阙写               ，下阙写             。',
            options: [
                'A. 浓情蜜意的相会 / 难舍难分的分别',
                'B. 难舍难分的分别 / 浓情蜜意的相会',
                'C. 长久分别的思念 / 无法见面的悲伤',
                'D. 无法见面的悲伤 / 长久分别的思念'
            ],
             correctIndex: 0,

        },
        {
            question: '下面对“迢迢”与“如梦”的理解正确的是__________。',
            options: [
                'A. 形容清晰的样子，突出了相聚之乐 / 反映了不忍离去又必须离开的无奈',
                'B. 形容清晰的样子，突出了相聚之乐 / 反映了不忍离去又必须离开的无奈',
                'C. 形容遥远的样子，突出了相思之苦 / 表现了相会的美好与时间的短暂',
                'D. 形容遥远的样子，突出了相思之苦 / 表现了相会的美好与时间的短暂'
            ],
              correctIndex: 3,
        }
    ],    
    }
   , {
    title : '《十五夜望月寄杜郎中》 唐·王建',
      content : '这首诗是诗人在农历八月十五中秋佳节的晚上与朋友相聚时，为寄托对远方朋友的思念之情而创作的。',
      poem : '中庭地白树栖鸦，冷露无声湿桂花。今夜月明人尽望，不知秋思落谁家。',
      notes : [
        '1. 十五夜：指的是八月十五中秋节的夜晚。中秋节是中国传统节日，以月之圆来象征人间的团圆，有赏月、吃月饼、看花灯、赏桂花、饮桂花酒等习俗。杜郎中：王建的朋友杜元颖。郎中：官职名，分掌各司事务，为尚书、侍郎之下的高级官员。',
        '2. 中庭：庭院中。地白：月光照在地上的样子。栖：栖息。',
        '3. 冷露：寒冷的露水。',
        '4. 尽：都。',
        '5. 秋思：秋天的情思，这里指对杜郎中的思念。落：到，在。',
      ],
      lines : [
        { text: '中庭地白树栖鸦，', pinyin: 'zhōng tíng dì bái shù qī yā，' },
        { text: '冷露无声湿桂花。', pinyin: 'lěng lù wú shēng shī guì huā。' },
        { text: '今夜月明人尽望，', pinyin: 'jīn yè yuè míng rén jìn wàng，' },
        { text: '不知秋思落谁家。', pinyin: 'bù zhī qiū sī luò shuí jiā。' },
      ],
      judgementQuestions : [
        '这首诗由中秋望月写到月明人远，层层推进。（    ）',
        '“中庭地白树栖鸦”中“地白”描写了地上因为落了秋霜而变成白色的样子。（    ）'
    ],
    judgementAnsList:[true,false],
    multipleChoiceQuestions : [
        {
            question: '如何理解“冷露无声湿桂花”中“桂花”这个意象？（可多选）______',
            options: [
                'A. 托物言志，蕴含着诗人“折桂”的理想',
                'B. 诗人月夜所见庭院中的桂花',
                'C. 诗人望月时联想到的月中桂树',
                'D. 使用了一语双关的表现手法'
            ],
             type: 'many',
            correctIndics:[1,2,3]
        },
        {
            question: '诗中“落”字的使用效果是______。（可多选）',
            options: [
                'A. 化虚为实,让月光成为秋思的载体',
                'B. 使不可见的思念变得可知可感',
                'C. 写出了秋思的轻盈缥缈',
                'D. 诗人多愁善感的体现'
            ],
             type: 'many',
            correctIndics:[0,1]
        }
    ],    
    }, {
        title : '《九月九日忆山东兄弟》 唐·王维',
      content : '这首诗是王维17岁时创作的。年轻的他为了求取功名，离开家乡，独自一人居住在长安。重阳节这一天他思念远在华山东面的家中亲人，于是创作了此诗。',
      poem : '独在异乡为异客，每逢佳节倍思亲。遥知兄弟登高处，遍插茱萸少一人。',
      notes : [
        '1. 九月九日：“九”在《易经》中为阳数，农历九月初九正好是“九九”两个阳数相重，所以称为“重阳”。中国古代重阳节有登高祈福、秋游赏菊、喝菊花酒、佩戴茱萸、拜神祭祖等习俗。忆：想念。山东：指诗人的家乡蒲州，因该地在华山的东面，所以诗中称为“山东”，意思是华山的东面。',
        '2. 异：其他的、不同的。',
        '3. 佳节：美好的节日。倍：更加，表程度递进。',
        '4. 遥知：远远地想到。',
        '5. 茱萸：一种带香味的植物，中国古人认为重阳节插戴茱萸可以避邪。',
      ],
      lines : [
        { text: '独在异乡为异客，', pinyin: 'dú zài yì xiāng wéi yì kè，' },
        { text: '每逢佳节倍思亲。', pinyin: 'měi féng jiā jié bèi sī qīn。' },
        { text: '遥知兄弟登高处，', pinyin: 'yáo zhī xiōng dì dēng gāo chù，' },
        { text: '遍插茱萸少一人。', pinyin: 'biàn chā zhū yú shǎo yì rén。' },
      ],
      judgementQuestions : [
        '全诗直接书写方式与含蓄表达结合，表达了身处他乡的诗人对亲人的思念之情。（    ）',
        '题目中的“山东”的意思是山东省。（    ）'
    ],
      judgementAnsList:[true,false],
    multipleChoiceQuestions : [
        {
            question: '诗歌首句“独在异乡为异客”中，用了两个“异”字，更加突出了___________。',
            options: [
                'A. 诗人对目前遭遇的愤愤不平', 
                'B. 诗人身处异乡的强烈孤独感', 
                'C. 诗人对政治环境的彻底失望', 
                'D. 诗人受到排挤后的郁闷心情'
            ],
             correctIndex: 1,
        },
        {
            question: '下面关于“遥知兄弟登高处，遍插茱萸少一人”理解不正确的是 _______。（可多选）',
            options: [
                'A. 描写了诗人登高插茱萸的情景。',
                'B. 对于想象中场景的描写',
                'C. 将思亲之情表达得委婉含蓄',
                'D. 采用了虚实结合的创作手法'
            ],
             type: 'many',
            correctIndics:[0,3]
        }
    ],    
    }


] */
/* let dataList = [
      {
         group: "flowersAndPlants",
    subGroup: "桃与荷",
        title : '《桃夭》周·佚名',
      content : '《桃夭》是中国古代第一部诗歌总集《诗经·国风·周南》中的一首诗，是在婚礼上演唱的庆贺女子出嫁、祝福新婚幸福美满的喜歌。',
      poem : '桃之夭夭，灼灼其华。之子于归，宜其室家。桃之夭夭，有蕡其实。之子于归，宜其家室。桃之夭夭，其叶蓁蓁。之子于归，宜其家人。',
      notes : [
        '1. 夭夭：花朵美丽繁华的样子。在中国文化中，桃花寓意美好的爱情、生活的幸福，象征对美好生活的希望，也用来形容女子面容姣好。',
        '2. 灼灼：花朵鲜艳如火的样子。',
        '3. 之子：这位姑娘。于归：出嫁。',
        '4. 宜：和顺、亲善。',
        '5. 蕡：果实又大又多的样子。',
        '6. 蓁蓁：草木茂密的样子，这里指桃叶茂密、桃树成荫。',
      ],
      lines : [
        { text: '桃之夭夭，灼灼其华。', pinyin: 'táo zhī yāo yāo，zhuò zhuò qí huá。' },
        { text: '之子于归，宜其室家。', pinyin: 'zhī zǐ yú guī，yí qí shì jiā。' },
        { text: '桃之夭夭，有蕡其实。', pinyin: 'táo zhī yāo yāo，yǒu fén qí shí。' },
        { text: '之子于归，宜其家室。', pinyin: 'zhī zǐ yú guī，yí qí jiā shì。' },
        { text: '桃之夭夭，其叶蓁蓁。', pinyin: 'táo zhī yāo yāo，qí yè zhēn zhēn。' },
        { text: '之子于归，宜其家人。', pinyin: 'zhī zǐ yú guī，yí qí jiā rén。' },
      ],
      judgementQuestions : [
        '“桃之夭夭，灼灼其华”将桃花与年轻美丽的新娘相联系，使用的是拟人的创作手法。（    ）',
        '“桃之夭夭，有蕡其实”从桃花盛开写到桃树枝头硕果累累，描写的是家中孩子出生的喜庆。（    ）'
    ],
    judgementAnsList:[false,true],
 
    multipleChoiceQuestions : [
        {
            question: '《桃夭》出自哪部古代文学经典？',
            options: [
                'A. 《楚辞》', 
                'B. 《诗经》', 
                'C. 《汉乐府》', 
                'D. 《唐诗三百首》'
            ],
            correctIndex: 1
        },
        {
            question: '诗中“夭夭”的意思是___________ ， “灼灼”的意思是_____________， “蓁蓁”的意思是_____________。',
            options: [
                'A. 花朵美丽繁华的样子 / 花朵鲜艳如火的样子 / 草木茂密的样子',
                'B. 花朵美丽繁华的样子 / 草木茂密的样子 / 花朵鲜艳如火的样子',
                'C. 花朵鲜艳如火的样子 / 花朵美丽繁华的样子 / 草木茂密的样子'
            ],
            correctIndex: 0,
        }
    ],    
    },
     {
         group: "flowersAndPlants",
    subGroup: "桃与荷",
        title : '《晓出净慈寺送林子方（其二）》宋·杨万里',
      content : '林子方是杨万里的好朋友，两人志向相合。1187年，林子方到福州任职，杨万里清晨在净慈寺送别林子方，经过西湖时写下了这首诗。',
      poem : '毕竟西湖六月中，风光不与四时同。接天莲叶无穷碧，映日荷花别样红。',
      notes : [
        '1. 毕竟：到底。',
        '2. 四时：春夏秋冬4个季节，在这里指6月以外的其他时节。',
        '3. 接天：与天空相接。无穷碧：无边无际的碧绿。',
        '4. 映日荷花：太阳映照下的荷花。由于荷花出淤泥而不染，有着亭亭玉立的形象，因此在中国传统文化中，荷花象征着纯洁、美好与高雅。别样红：红得特别出色。别样：特别，不一样。',
      ],
      lines : [
        { text: '毕竟西湖六月中，', pinyin: 'bì jìng xī hú liù yuè zhōng，' },
        { text: '风光不与四时同。', pinyin: 'fēng guāng bú yǔ sì shí tóng。' },
        { text: '接天莲叶无穷碧，', pinyin: 'jiē tiān lián yè wú qióng bì，' },
        { text: '映日荷花别样红。', pinyin: 'yìng rì hé huā bié yàng hóng。' },
      ],
      judgementQuestions : [
        '“映日荷花”的意思是太阳映照下的荷花，因此，诗人是在正午时分送别友人。（    ）',
        '诗作在写景的同时也表达了即将前往杭州的友人深深的眷恋之情。（    ）'
    ], 
    judgementAnsList:[false,true],

    multipleChoiceQuestions : [
        {
            question: '“毕竟”的意思是___________ ，表现出作者的 _______之情。',
            options: [
                'A. 必然 失望', 
                'B. 必然 惊喜', 
                'C. 到底 失望', 
                'D. 到底 惊喜'
            ],
             correctIndex: 1,
        },
        {
            question: '“接天莲叶无穷碧，映日荷花别样红”使用了________的创作手法。',
            options: [
                'A. 白描 同色烘染', 
                'B. 白描 异色映衬', 
                'C. 比喻 同色烘染', 
                'D. 比喻 异色映衬'
            ],
             correctIndex: 0,
        }
    ],    
    }
   ,{
     group: "flowersAndPlants",
    subGroup: "菊与梅",

        title : '《饮酒二十首（其五）》晋·陶渊明',
      content : '405年，陶渊明辞官回到田园，《饮酒二十首》大约作于诗人回归田园之后的第12年。陶渊明是中国文学史上第一个大量写饮酒诗的诗人。',
      poem : '结庐在人境，而无车马喧。问君何能尔？心远地自偏。采菊东篱下，悠然见南山。山气日夕佳，飞鸟相与还。此中有真意，欲辨已忘言。',
      notes : [
        '1. 结庐：建造房屋。',
        '2. 车马喧：指世俗交往的喧扰。喧：喧扰。',
        '3. 君：指诗人自己。何：为什么。尔：这样。',
        '4. 偏：僻静。',
        '5. 采菊：采摘菊花。菊花很早就出现在中国古诗词中，例如屈原《离骚》中 “朝饮木兰之坠露兮，夕餐秋菊之落英”，奠定了菊花高洁的形象，陶渊明则将菊花与高洁品格更进一步结合，赋予了菊花隐逸的品格，使菊花逐渐成了隐逸者的象征，被称为“花中隐士”。',
        '6. 悠然：悠闲自得的样子。',
        '7. 山气：山中的气息。佳：美好。',
        '8. 相与还：结伴而归。',
        '9. 此中：此时此地的情和境。真意：人生真正的意义与乐趣。',
        '10. 辨：辨识。',
      ],
      lines : [
        { text: '结庐在人境，', pinyin: 'jié lú zài rén jìng，' },
        { text: '而无车马喧。', pinyin: 'ér wú chē mǎ xuān。' },
        { text: '问君何能尔？', pinyin: 'wèn jūn hé néng ěr？' },
        { text: '心远地自偏。', pinyin: 'xīn yuǎn dì zì piān。' },
        { text: '采菊东篱下，', pinyin: 'cǎi jú dōng lí xià，' },
        { text: '悠然见南山。', pinyin: 'yōu rán jiàn nán shān。' },
        { text: '山气日夕佳，', pinyin: 'shān qì rì xī jiā，' },
        { text: '飞鸟相与还。', pinyin: 'fēi niǎo xiāng yǔ huán。' },
        { text: '此中有真意，', pinyin: 'cǐ zhōng yǒu zhēn yì，' },
        { text: '欲辨已忘言。', pinyin: 'yù biàn yǐ wàng yán。' },
      ],
      judgementQuestions : [
        '这首诗书写的是诗人被贬官之后的惆怅与失落。（    ）',
        '“此中有真意，欲辨已忘言”，“此”指的是隐居的田园生活，“忘言”的意思是忘记了说话。（    ）'
    ],
     judgementAnsList:[false,true],
    multipleChoiceQuestions : [
        {
            question: '王国维在《人间词话》中评价____________________为“无我之境”。',
            options: [
                'A. 结庐在人境，而无车马喧', 
                'B. 采菊东篱下，悠然见南山', 
                'C. 山气日夕佳，飞鸟相与还', 
                'D. 此中有真意，欲辨已忘言'
            ],
             correctIndex: 3,
        },
        {
            question: '诗人用“心远地自偏” __________________。（可多选）',
            options: [
                'A. 反映对隐居生活的向往',
                'B. 强调居所位置的偏远',
                'C. 凸显内心宁静淡泊的重要',
                'D. 表现对争名夺利毫不关心的态度'
            ],
             correctIndex: 1,
        }
    ],    
    }
    , {
       group: "flowersAndPlants",
    subGroup: "菊与梅",
        title : '《卜算子·咏梅》宋·陆游',
      content : '陆游出生于北宋末年，年少时生活动荡不定，后来仕途也不顺利，两次被罢官，所以他将自己的志向寄托在梅花中，创作了许多咏梅诗词，这首就是其中的代表。',
      poem : '驿外断桥边，寂寞开无主。已是黄昏独自愁，更著风和雨。无意苦争春，一任群芳妒。零落成泥碾作尘，只有香如故。',
      notes : [
        '1. 咏梅：赞颂梅花。梅花在严寒中开放，因此，在中国传统文化中，梅花象征着高洁、坚强、谦虚的品格，给人以立志奋发的激励。',
        '2. 驿：驿馆，旅店。断桥：残破的桥。',
        '3. 无主：无人照管和玩赏。',
        '4. 更：又，再。著：同“着”，遭受。',
        '5. 无意：不想，没有心思。苦：尽力，竭力。争春：与百花争艳，这里指争权。',
        '6. 一任：完全听凭。群芳：百花、群花，这里借指苟且偷安的主和派。',
        '7. 零落：凋零落下。碾：压碎。',
        '8. 香如故：清香依旧存在。',
      ],
      lines : [
        { text: '驿外断桥边，', pinyin: 'yì wài duàn qiáo biān，' },
        { text: '寂寞开无主。', pinyin: 'jì mó kāi wú zhǔ。' },
        { text: '已是黄昏独自愁，', pinyin: 'yǐ shì huáng hūn dú zì chòu，' },
        { text: '更著风和雨。', pinyin: 'gèng zhuò fēng hé yǔ。' },
        { text: '无意苦争春，', pinyin: 'wú yì kǔ zhēng chūn，' },
        { text: '一任群芳妒。', pinyin: 'yí rèn qún fāng dù。' },
        { text: '零落成泥碾作尘，', pinyin: 'líng luó chéng ní niǎn zuó chén，' },
        { text: '只有香如故。', pinyin: 'zhǐ yǒu xiāng rú gù。' },
      ],
      judgementQuestions : [
        '梅花在“风和雨”的环境中成长开花，词人见到此情景是非常喜悦的。（    ）',
        '“零落成泥碾作尘”表达了词人对梅花悲惨命运的深深同情。（    ）'
    ],
    judgementAnsList:[false,true],
    multipleChoiceQuestions : [
        {
            question: '“独自愁”以       的手法写出了梅花的精神状态，凸显了          。',
            options: [
                'A. 夸张  寂寞与冷清', 
                'B. 夸张  无聊与忧伤', 
                'C. 拟人  寂寞与冷清', 
                'D. 拟人  无聊与忧伤'
            ],
             correctIndex: 2,
        },
        {
            question: '“已是黄昏独自愁，更著风和雨”中的“更”的意思是_________，“著”的意思是_________。',
            options: [
                'A. 进一步 / 经历', 
                'B. 进一步 / 遭受', 
                'C. 又，再 / 穿着', 
                'D. 又，再 / 遭受'
            ],
             correctIndex: 3,
        }
    ],    
    }
    ,{
        group: "flowersAndPlants",
    subGroup: "苔与草",
     judgementAnsList:[false,false],
        title : '《苔》清·袁枚',
      content : '这首诗是袁枚归隐十余年后，在他的恩师尹继善得到朝廷嘉赏之后创作的，表达了他想要向恩师学习，未来要有所成就的人生志趣。',
      poem : '白日不到处，青春恰自来。苔花如米小，也学牡丹开。',
      notes : [
        '1. 苔：苔藓，植物名。苔藓生长在阴暗潮湿的地方，不像其他植物那样拥有鲜艳夺目的花朵，但是它却能在不宜植物生存之处绿意盎然，象征着顽强的生命力。',
        '2. 白日：太阳。',
        '3. 青春：草木生长旺盛的样子，这里指的是苔藓富有生机的绿色。',
      ],
      lines : [
        { text: '白日不到处，', pinyin: 'bái rì bú dào chù，' },
        { text: '青春恰自来。', pinyin: 'qīng chūn qià zì lái。' },
        { text: '苔花如米小，', pinyin: 'tái huā rú mǐ xiǎo，' },
        { text: '也学牡丹开。', pinyin: 'yě xué mǔ dān kāi。' },
      ],
      judgementQuestions : [
        '这首诗中苔藓被描绘为生长在阳光充足、土壤肥沃的地方。（    ）',
        '“苔花如米小，也学牡丹开”的意思是苔花像米粒那样小，所以只能悄悄地在牡丹旁边开放。（    ）'
    ],
    multipleChoiceQuestions : [
        {
            question: '《苔》的作者是清代诗人袁枚，使用了________的创作手法。',
            options: [
                'A. 侧面烘托', 
                'B. 借景抒情', 
                'C. 寓情于景', 
                'D. 托物言志'
            ],
             correctIndex: 3,
        },
        {
            question: '诗中将苔花和牡丹比较的时候，运用了______的修辞手法，其中______字生动地描绘出苔花努力绽放的样子。',
            options: [
                'A. 比喻 / 学', 
                'B. 比喻 / 如', 
                'C. 拟人 / 学', 
                'D. 拟人 / 如'
            ],
             correctIndex: 2,
        }
    ],    
    }
    , {
       group: "flowersAndPlants",
    subGroup: "苔与草",
     judgementAnsList:[false,true],
        title : '《赋得古原草送别》唐·白居易',
      content : '《赋得古原草送别》创作于787年前后，当时白居易只有16岁，此诗是他准备参加科举考试的习作，按当时考试的规定，限定内容的诗题，题目前须加“赋得”二字。',
      poem : '离离原上草，一岁一枯荣。野火烧不尽，春风吹又生。远芳侵古道，晴翠接荒城。又送王孙去，萋萋满别情。',
      notes : [
        '1. 赋得：得到题目赋诗，这是古人学习写诗、聚会分题作诗或者科举考试时命题作诗的常用方式。',
        '2. 离离：青草茂盛的样子。草能够在大地上随处生长，象征着顽强旺盛的生命力；同时也代表着希望和未来，常被用来表达对美好事物的期待；此外，在文学作品中，草还常常与相思和离别的情感联系在一起。',
        '3. 枯：枯萎。荣：茂盛。',
        '4. 远芳：远处芬芳的野草。侵：侵占，长满。',
        '5. 晴翠：阳光照耀下的草原翠绿。',
        '6. 王孙：贵族，这里指诗人的朋友。',
        '7. 萋萋：形容草木长得茂盛的样子。',
      ],
      lines : [
        { text: '离离原上草，', pinyin: 'lí lí yuán shàng cǎo，' },
        { text: '一岁一枯荣。', pinyin: 'yí suì yì kū ròng。' },
        { text: '野火烧不尽，', pinyin: 'yě huǒ shāo bú jìn，' },
        { text: '春风吹又生。', pinyin: 'chūn fēng chuī yóu shēng。' },
        { text: '远芳侵古道，', pinyin: 'yuǎn fāng qīn gǔ dào，' },
        { text: '晴翠接荒城。', pinyin: 'qíng cuì jiē huāng chéng。' },
        { text: '又送王孙去，', pinyin: 'yòu sóng wáng sūn qù，' },
        { text: '萋萋满别情。', pinyin: 'qī qī mǎn bié qíng。' },
      ],
      judgementQuestions : [
        '“晴翠接荒城”中“晴翠”表现出雨过天晴之后，草绿得像翡翠一样的特点。（    ）',
        '这首诗中草象征着顽强旺盛的生命力，同时也与离别的情感联系起来。（    ）'
    ],
    multipleChoiceQuestions : [
        {
            question: '下面关于“离离原上草，一岁一枯荣”理解正确的是__________。（可多选）',
            options: [
                'A. 与诗题中的“古原草”三字相呼应',
                'B. “枯”与“野火烧”对应，“荣”与“吹又生”对应。',
                'C. “离离”是叠字词，写出了春草的繁茂。',
                'D. 两个“一”字写出了“原上草”生生不息的特点'
            ],
              type: 'many',
            correctIndics:[0,2,3]
        },
        {
            question: '“又送王孙去，萋萋满别情”所运用的修辞手法是__________，创作手法是__________。',
            options: [
                'A. 比喻 / 情景交融',
                'B. 拟人 / 情景交融',
                'C. 对偶 / 托物言志',
                'D. 夸张 / 托物言志'
            ],
             correctIndex: 1,
        }
    ]   
    }
   , {
     group: "flowersAndPlants",
    subGroup: "竹与松",
    title : '《竹里馆》唐·王维',
      content : '这首诗作于王维晚年隐居辋川时期。他早年信奉佛教，思想超脱，加上仕途坎坷，40岁以后就过着半官半隐的生活。隐居期间，他心思澄净，与竹林、明月本身所具有的清幽相似，于是创作了这首诗。',
      poem : '独坐幽篁里，弹琴复长啸。深林人不知，明月来相照。',
      notes : [
        '1. 幽篁：幽深的竹林。竹在中国传统文化中象征人品清逸和气节高尚的君子；用竹子四季常青、空心、挺直等特征，比喻高雅、虚心、有气节等。',
        '2. 啸：口中发出长而清脆的声音。',
        '3. 相照：和“独坐”对应，指的是没有人来陪伴，只有月光照射在身上。',
      ],
      lines : [
        { text: '独坐幽篁里，', pinyin: 'dú zuó yōu huáng lǐ，' },
        { text: '弹琴复长啸。', pinyin: 'tán qín fù cháng xiào。' },
        { text: '深林人不知，', pinyin: 'shēn lín rén bù zhī，' },
        { text: '明月来相照。', pinyin: 'míng yuè lái xiàng zhào。' },
      ],
      judgementQuestions : [
        '竹在中国传统文化中象征人品清逸和气节高尚的君子。（    ）',
        '这首诗是王维在长安做官期间所创作的。（    ）'
    ],
    judgementAnsList:[true,false],
    multipleChoiceQuestions : [
        {
            question: '全诗将诗人_________的心境与自然的景致融为一体。',
            options: [
                'A. 失意无助', 
                'B. 宁静淡泊', 
                'C. 惆怅忧伤', 
                'D. 喜悦愉快'
            ],
             correctIndex: 1,
        },
        {
            question: '“明月来相照”运用了________的手法。',
            options: [
                'A. 对比', 
                'B. 拟人', 
                'C. 排比', 
                'D. 象征'
            ],
             correctIndex: 1,
        }
    ],    
    },
     {
        group: "flowersAndPlants",
    subGroup: "竹与松",
    judgementAnsList:[true,false],
        title : '《南轩松》唐·李白',
      content : '724年，李白决意“仗剑去国，辞亲远游”，3年间遍游长江中下游一带之后来到安州（今湖北安陆），《南轩松》就作于727年。唐代范传正的《唐左拾遗翰林学士李公新墓碑并序》评价李白“常欲一鸣惊人，一飞冲天”，这首诗就表现了李白的这种理想。',
      poem : '南轩有孤松，柯叶自绵幂。清风无闲时，潇洒终日夕。阴生古苔绿，色染秋烟碧。何当凌云霄，直上数千尺。',
      notes : [
        '1. 南轩：窗户的南面。轩：窗户。',
        '2. 孤松：孤傲的松树。松树不怕严寒、四季常青，象征着坚韧顽强、挺直高洁的品质，与松、竹、梅并称为“岁寒三友”；此外，松树也象征长寿和健康，“寿比南山不老松”用于给老人祝寿。',
        '3. 柯叶：枝叶。绵幂：茂密的样子。',
        '4. 潇洒：这里用来形容松树的枝叶在风中摆动的样子。',
        '5. 阴生：在阴凉处生长出来。',
        '6. 秋烟：秋天的云雾。',
        '7. 何当：何时。凌：到达。',
      ],
      lines : [
        { text: '南轩有孤松，', pinyin: 'nán xuān yǒu gū sōng，' },
        { text: '柯叶自绵幂。', pinyin: 'kē yè zì mián mì。' },
        { text: '清风无闲时，', pinyin: 'qīng fēng wú xián shí，' },
        { text: '潇洒终日夕。', pinyin: 'xiāo sǎ zhōng rì xī。' },
        { text: '阴生古苔绿，', pinyin: 'yīn shēng gǔ tái lǜ，' },
        { text: '色染秋烟碧。', pinyin: 'sè rǎn qiū yān bì。' },
        { text: '何当凌云霄，', pinyin: 'hé dāng líng yún xiāo，' },
        { text: '直上数千尺。', pinyin: 'zhí shàng shù qiān chǐ。' },
      ],
      judgementQuestions : [
        '“轩”指窗户，诗题“南轩松”表明主要描写的是窗户南面的一棵松树。（    ）',
        '“秋烟”指的是秋天做饭的时候升起的烟雾。（    ）'
    ],
    multipleChoiceQuestions : [
        {
            question: '“何当凌云霄，直上数千尺”未使用的手法是_______。',
            options: [
                'A. 夸张', 
                'B. 托物言志', 
                'C. 排比'
            ],
             correctIndex: 1,
        },
        {
            question: '               突出了松树的年岁之长与高大苍翠。',
            options: [
                'A. 南轩有孤松，柯叶自绵幂',
                'B. 清风无闲时，潇洒终日夕',
                'C. 阴生古苔绿，色染秋烟碧',
                'D. 何当凌云霄，直上数千尺'
            ],
             correctIndex: 2,
        }
    ]   
    },
] */

/* let dataList = [
  {
    group: "seasonal",
    subGroup: "春",
    judgementAnsList: [true, false],

    title: "《春晓》唐·孟浩然",
    content:
      "孟浩然早年曾隐居鹿门山，后入长安读求官职，没有考中进士，又回到故乡。这首诗是他早年间隐居湖北襄阳鹿门山时所作。",
    poem: "春眠不觉晓，处处闻啼鸟。夜来风雨声，花落知多少。",
    notes: [
      "1. 晓：天刚亮的时候。",
      "2. 不觉：不知不觉。",
      "3. 闻：听见。啼鸟：鸟儿鸣叫。",
      "4. 知多少：不知道有多少。",
    ],
    lines: [
      {
        text: "江南好，风景旧曾谙；",
        pinyin: "jiāng nán hǎo，fēng jǐng jiù céng ān；",
      },
      { text: "日出江花红胜火，", pinyin: "rì chū jiāng huā hóng shèng huǒ," },
      { text: "春来江水绿如蓝。", pinyin: "chūn lái jiāng shuǐ lǜ rú lán。" },
      { text: "能不忆江南？", pinyin: "néng bú yì jiāng nán？" },
      {
        text: "江南忆，最忆是杭州；",
        pinyin: "jiāng nán yì，zuì yì shì háng zhōu；",
      },
      { text: "山寺月中寻桂子，", pinyin: "shān sì yuè zhōng xún guì zǐ，" },
      {
        text: "郡亭枕上看潮头。",
        pinyin: "jùn tíng zhěn shàng kàn cháo tóu。",
      },
      { text: "何日更重游！", pinyin: "hé rì gèng chóng yóu！" },
    ],
    judgementQuestions: [
      "《春晓》是孟浩然早年间隐居鹿门山时所创作的。（    ）",
      "“花落知多少”这句诗描写了诗人所看到的雨后落花的场景。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question: "以“春声”将读者从屋内引向屋外的诗句是______________。",
        options: [
          "A. 春眠不觉晓",
          "B. 处处闻啼鸟",
          "C. 夜来风雨声",
          "D. 花落知多少",
        ],
        correctIndex: 2,
      },
      {
        question: "“夜来风雨声”一句主要描绘了诗人怎样的感官体验？",
        options: ["A. 视觉", "B. 听觉", "C. 嗅觉", "D. 触觉"],
        correctIndex: 1,
      },
    ],
  },
  {
    group: "seasonal",
    subGroup: "春",
    judgementAnsList: [true, true],
    title: "《咏柳》唐·贺知章",
    content:
      "744年，贺知章回到家乡，有一天他坐船去南门外潘水河边的旧宅，见到了一株高大的柳树，当时正是二月早春，柳芽初发，春意盎然，微风拂面，美好的景色促使他提笔写下了《咏柳》。",
    poem: "碧玉妆成一树高，万条垂下绿丝绦。不知细叶谁裁出，二月春风似剪刀。",
    notes: [
      "1. 碧玉：碧绿色的玉，这里用来形容春天嫩绿的柳叶。妆：打扮。",
      "2. 丝绦：丝带。",
      "3. 裁：裁剪。",
      "4. 似：好像。",
    ],
    lines: [
      { text: "碧玉妆成一树高，", pinyin: "bì yù zhuāng chéng yí shù gāo，" },
      { text: "万条垂下绿丝绦。", pinyin: "wàn tiáo chuí xià lǜ sī tāo。" },
      { text: "不知细叶谁裁出，", pinyin: "bù zhī xì yè shuí cái chū，" },
      { text: "二月春风似剪刀。", pinyin: "èr yuè chūn fēng sì jiǎn dāo。" },
    ],
    judgementQuestions: [
      "这首诗写早春时节的柳树与春风，洋溢着喜悦之情。（    ）",
      "“碧玉妆成一树高”中用“碧玉”来形容绿色的柳叶，同时将柳树化身为穿着绿衣的女子。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question:
          "“万条垂下绿丝绦”中的“绿丝绦”的意思是      ，这句诗写的是      。",
        options: [
          "A. 绿色的丝带 / 柳叶之美",
          "B. 绿色的丝带 / 柳枝之美",
          "C. 绿色的波纹 / 柳叶之美",
          "D. 绿色的波纹 / 柳枝之美",
        ],
        correctIndex: 1,
      },
      {
        question:
          "下面关于“不知细叶谁裁出，二月春风似剪刀”理解不正确是_______。",
        options: [
          "A. 结合使用了比喻、拟人的修辞手法",
          "B. 一问一答的设问方式",
          "C. 将剪刀比作了二月春风",
          "D. 赞美了春风带来的美好春天",
        ],
        type: "many",
        correctIndics: [0, 1, 3],
      },
    ],
  },
  {
    group: "seasonal",
    subGroup: "春",
    judgementAnsList: [false, true],
    title: "《绝句二首（其一）》唐·杜甫",
    content:
      "《绝句二首》（其一）是杜甫定居在成都浣花溪时期的作品，大约创作于764年的暮春，当时安史之乱已经结束，杜甫看到眼前的美景是愉悦的，而且带着一种期望回归故乡的心情。",
    poem: "迟日江山丽，春风花草香。泥融飞燕子，沙暖睡鸳鸯。",
    notes: [
      "1. 迟日：春日，因为春天白日渐长，所以说迟日。丽：秀丽。",
      "2. 泥融：这里指泥土湿润。",
    ],
    lines: [
      { text: "迟日江山丽，", pinyin: "chí rì jiāng shān lì，" },
      { text: "春风花草香。", pinyin: "chūn fēng huā cǎo xiāng。" },
      { text: "泥融飞燕子，", pinyin: "ní ròng fēi yàn zǐ，" },
      { text: "沙暖睡鸳鸯。", pinyin: "shā nuǎn shuì yuān yāng。" },
    ],
    judgementQuestions: [
      "这首诗是一首五言律诗，表达出诗人对春天的喜爱之情。（    ）",
      "“春风花草香”通过嗅觉感受，直接描绘了春风中花草的香气四溢。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question: "“迟日”的意思是___________，“泥融”的意思是____________。",
        options: [
          "A. 春日  泥土湿润",
          "B. 春日  泥土硬结",
          "C. 秋日  泥土湿润",
          "D. 秋日  泥土硬结",
        ],
        correctIndex: 0,
      },
      {
        question:
          "“泥融飞燕子，沙暖睡鸳鸯”两句诗所使用的创作手法是___________。",
        options: ["A. 明暗对比", "B. 异色衬托", "C. 动静结合"],
        correctIndex: 2,
      },
    ],
  },
  {
    group: "seasonal",
    subGroup: "夏",
    judgementAnsList: [false, false],
    title: "《山亭夏日》唐·高骈",
    content:
      "这首诗具体创作时间目前尚未确证。山亭是山中别墅的一个亭子，高骈当时正在山亭中乘凉，见到此处夏日的景致优雅迷人，有感而发，创作了这首诗，精心捕捉并巧妙地表现出了炎夏中的凉意。",
    poem: "绿树阴浓夏日长，楼台倒影入池塘。水晶帘动微风起，满架蔷薇一院香。",
    notes: [
      "1. 阴：树荫。浓：树丛的阴影很浓。",
      "2. 水晶帘：装饰着水晶的帘子，这里比喻水面。",
    ],
    lines: [
      { text: "绿树阴浓夏日长，", pinyin: "lǜ shù yīn nòng xià rì cháng，" },
      { text: "楼台倒影入池塘。", pinyin: "lòu tái dào yǐng rù chí táng。" },
      { text: "水晶帘动微风起，", pinyin: "shuǐ jīng lián dóng wēi fēng qǐ，" },
      { text: "满架蔷薇一院香。", pinyin: "mǎn jià qiáng wēi yī yuàn xiāng。" },
    ],
    judgementQuestions: [
      "“楼台倒影入池塘”。（    ）",
      "“水晶帘动微风起”中的“水晶帘”是挂在山亭之中的用水晶做的帘子。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question: "_____________使读者仿佛置身于微风吹来的花香之中。",
        options: [
          "A. 绿树阴浓夏日长",
          "B. 楼台倒影入池塘",
          "C. 水晶帘动微风起",
          "D. 满架蔷薇一院香",
        ],
        correctIndex: 3,
      },
      {
        question:
          "全诗最为精巧的一句是“水晶帘动微风起”，用了     的修辞手法，将______比作______。",
        options: [
          "A. 类比 / 水晶帘 / 水面",
          "B. 类比 / 水面 / 水晶帘",
          "C. 比喻 / 水晶帘 / 水面",
          "D. 比喻 / 水面 / 水晶帘",
        ],
        correctIndex: 3,
      },
    ],
  },
  {
    group: "seasonal",
    subGroup: "夏",
    judgementAnsList: [true, false],
    title: "《小池》宋·杨万里",
    content:
      "杨万里到常州任职以后，经常漫步郊野，欣赏大自然的美景。这首小诗就是诗人赏景时，以新奇的眼光看待身边的事物所即兴创作的作品。",
    poem: "泉眼无声惜细流，树阴照水爱晴柔。小荷才露尖尖角，早有蜻蜓立上头。",
    notes: [
      "1. 泉眼：泉水的出口。惜：舍不得。",
      "2. 照水：倒映在水里。晴柔：晴天柔和的风光。",
      "3. 小荷：娇嫩的荷叶。尖尖角：初出水端还没有舒展的荷叶尖端。",
      "4. 上头：上面，顶端。",
    ],
    lines: [
      { text: "泉眼无声惜细流，", pinyin: "quán yǎn wú shēng xī xì liú，" },
      { text: "树阴照水爱晴柔。", pinyin: "shù yīn zhào shuǐ ài qíng ròu。" },
      { text: "小荷才露尖尖角，", pinyin: "xiǎo hé cái lù jiān jiān jiǎo，" },
      { text: "早有蜻蜓立上头。", pinyin: "zǎo yǒu qīng tíng lì shàng tóu。" },
    ],
    judgementQuestions: [
      "“树阴照水爱晴柔”写出了树阴保护着晴日美景的样子。（    ）",
      "这是一首七言讽喻诗，“才露”与“早有”体现出诗人敏锐的观察力。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question:
          "“泉眼无声惜细流”中“惜”的意思是_______，以      的手法写出了泉眼对于细流的珍惜。",
        options: [
          "A. 可惜  拟人",
          "B. 舍不得  拟人",
          "C. 可惜  对比",
          "D. 舍不得  对比",
        ],
        correctIndex: 1,
      },
      {
        question: "____________形象地描绘了刚露出水面的荷叶嫩尖。",
        options: [
          "A. 泉眼无声惜细流",
          "B. 树阴照水爱晴柔",
          "C. 小荷才露尖尖角",
          "D. 早有蜻蜓立上头",
        ],
        correctIndex: 2,
      },
    ],
  },
  {
    group: "seasonal",
    subGroup: "夏",
    judgementAnsList: [false, false],
    title: "《西江月·夜行黄沙道中》宋·辛弃疾",
    content:
      "1181年，辛弃疾因受奸臣排挤，被免罢官，回到上饶带湖居住，并在这里生活了近15年。在此期间，他重视农业生产，同情民间疾苦，留下了不少词作。这首词就是他居住在上饶的时候，有一次经过黄沙岭道时所写。",
    poem: "明月别枝惊鹊，清风半夜鸣蝉。稻花香里说丰年，听取蛙声一片。七八个星天外，两三点雨山前。旧时茅店社林边，路转溪桥忽见。",
    notes: [
      "1. 别枝：横斜的树枝。",
      "2. 七八个：指星星稀疏。",
      "3. 旧时：往日。茅店：茅草盖的乡村客店。社林：土地庙附近的树林。社：土地神庙。",
      "4. 忽见：忽然出现。见，同“现”，出现。",
    ],
    lines: [
      { text: "明月别枝惊鹊，", pinyin: "míng yuè bié zhī jīng què，" },
      { text: "清风半夜鸣蝉。", pinyin: "qīng fēng bàn yè míng chán。" },
      { text: "稻花香里说丰年，", pinyin: "dào huā xiāng lǐ shuō fēng nián，" },
      { text: "听取蛙声一片。", pinyin: "tīng qǔ wā shēng yí piàn。" },
      { text: "七八个星天外，", pinyin: "qī bā gè xīng tiān wài，" },
      { text: "两三点雨山前。", pinyin: "liǎng sān diǎn yǔ shān qián。" },
      { text: "旧时茅店社林边，", pinyin: "jiù shí máo diàn shè lín biān，" },
      { text: "路转溪桥忽见。", pinyin: "lù zhuǎn xī qiáo hū xiàn。" },
    ],
    judgementQuestions: [
      "“明月别枝惊鹊，清风半夜鸣蝉”这两句词中，月光中有鹊飞，清风中有蝉鸣，明暗对比强烈。（    ）",
      "“七八个星天外，两三点雨山前”描绘了从星星满天到突然下起大雨的天气变化。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question:
          "这首词的作者是    ，上阙写的是___________ ，下阙写的是_______________。",
        options: [
          "A. 豪放派词人辛弃疾 / 山村夜行乐趣 / 乡野夜间景色",
          "B. 豪放派词人辛弃疾 / 乡野夜间景色 / 山村夜行乐趣",
          "C. 婉约派词人辛弃疾 / 山村夜行乐趣 / 乡野夜间景色",
          "D. 婉约派词人辛弃疾 / 乡野夜间景色 / 山村夜行乐趣",
        ],
        correctIndex: 1,
      },
      {
        question:
          "“旧时茅店社林边，路转溪桥忽见”中“路转”与“忽见”所体现的词人心情是      。",
        options: ["A. 失望", "B. 惊喜", "C. 无奈", "D. 郁闷"],
        correctIndex: 1,
      },
    ],
  },
  {
    group: "seasonal",
    subGroup: "秋",
    judgementAnsList: [true, true],
    title: "《秋词二首（其一）》唐·刘禹锡",
    content:
      "805年刘禹锡被贬官，但是他并没有消沉下去，而是用乐观豁达的心态对待，这首诗就是他被贬到朗州（现在的湖南省常德市）时创作的。",
    poem: "自古逢秋悲寂寥，我言秋日胜春朝。晴空一鹤排云上，便引诗情到碧霄。",
    notes: [
      "1. 逢：每当遇到。寂寥：空寂与萧条。",
      "2. 胜：胜过。",
      "3. 排云：推开，冲破。",
      "4. 诗情：作诗的情绪与兴致。碧霄：青天。",
    ],
    lines: [
      { text: "自古逢秋悲寂寥，", pinyin: "zì gǔ féng qiū bēi jì liáo，" },
      { text: "我言秋日胜春朝。", pinyin: "wǒ yán qiū rì shèng chūn zhāo。" },
      { text: "晴空一鹤排云上，", pinyin: "qíng kōng yí hè pái yún shàng，" },
      { text: "便引诗情到碧霄。", pinyin: "biàn yǐn shī qíng dào bì xiāo。" },
    ],
    judgementQuestions: [
      "诗中“便引诗情到碧霄”直接抒发了诗人的豪情壮志。（    ）",
      "这首诗虽然是诗人贬官之后所作，但是其中却表现出积极向上的情绪。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question:
          "“晴空一鹤排云上，便引诗情到碧霄”可以看出诗人的情感态度是_______。",
        options: ["A. 郁闷", "B. 失落", "C. 痛苦", "D. 乐观"],
        correctIndex: 3,
      },
      {
        question:
          "对于“云”与“鹤”这两个意象同时使用的效果，理解不正确的是_______。",
        options: [
          "A. 白云衬托鹤飞之高远",
          "B. 通过云与鹤表达渴望自由的心情",
          "C. 飞鹤凸显云朵之轻盈",
          "D. 描绘了生动的秋日白云飞鹤图",
        ],
        type: "many",
        correctIndics: [0, 2, 3],
      },
    ],
  },
  {
    group: "seasonal",
    subGroup: "秋",
    judgementAnsList: [true, false],
    title: "《山行》唐·杜牧",
    content:
      "这首诗的创作时间目前尚未确证，可能是杜牧第二次被贬离京的时候。深秋时节，他陶醉于如诗如画的枫林晚景中，感受到了生命的力量，创作了这首诗，赞美自然的美好，表现出昂扬向上的内心情感。",
    poem: "远上寒山石径斜，白云生处有人家。停车坐爱枫林晚，霜叶红于二月花。",
    notes: [
      "1. 远上：登上远处的。寒山：深秋季节的山。石径：石子小路。斜：倾斜，弯弯曲曲。",
      "2. 白云生处：白云升腾的地方。",
      "3. 坐：因为。枫林晚：傍晚时的枫树林。",
      "4. 霜叶：经过寒霜的枫叶。红于：比……更红。",
    ],
    lines: [
      {
        text: "远上寒山石径斜，",
        pinyin: "yuǎn shàng hán shān shí jìng xiá，",
      },
      { text: "白云生处有人家。", pinyin: "bái yún shēng chù yǒu rén jiā。" },
      { text: "停车坐爱枫林晚，", pinyin: "tíng chē zuó ài fēng lín wǎn，" },
      { text: "霜叶红于二月花。", pinyin: "shuāng yè hòng yú èr yuè huā。" },
    ],
    judgementQuestions: [
      "诗中既有“寒山”“白云”构成的淡雅风景，又有火红枫叶这样的艳丽秋色。（    ）",
      "“霜叶红于二月花”中“红于”表明诗人认为春天的花朵更红更美。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question: "“停车坐爱枫林晚”中的“坐”的意思是______。",
        options: ["A. 坐下", "B. 因为", "C. 非常", "D. 乘坐"],
        correctIndex: 1,
      },
      {
        question:
          "_____________体现出山的高大,同时引发读者对于山中人家生活的想象。",
        options: [
          "A. 远上寒山石径斜",
          "B. 白云生处有人家",
          "C. 停车坐爱枫林晚",
          "D. 霜叶红于二月花",
        ],
        correctIndex: 3,
      },
    ],
  },
  {
    group: "seasonal",
    subGroup: "秋",
    judgementAnsList: [true, true],
    title: "《天净沙·秋思》元·马致远",
    content:
      "由于元朝统治者实行民族压迫政策，马致远建功立业的理想始终未能实现。他大部分时间都过着远离故乡、漂泊不定的生活，在一次远游途中，写下了这首《天净沙·秋思》。悲秋，是人们面对秋景所产生的一种悲哀忧愁的情绪体验，马致远的这首小令就是悲秋名作，被后人誉为“秋思之祖”。",
    poem: "枯藤老树昏鸦，小桥流水人家。古道西风瘦马。夕阳西下，断肠人在天涯。",
    notes: [
      "1. 枯藤：枯萎的藤蔓。昏鸦：黄昏时归巢的乌鸦。",
      "2. 古道：年代久远的驿道。西风：寒冷的秋风。",
      "3. 断肠人：形容伤心悲痛到极点的人，指漂泊在外、孤独忧伤的旅人。天涯：远离家乡的地方。",
    ],
    lines: [
      { text: "枯藤老树昏鸦，", pinyin: "kū téng lǎo shù hūn yā，" },
      { text: "小桥流水人家。", pinyin: "xiǎo qiáo liú shuǐ rén jiā。" },
      { text: "古道西风瘦马。", pinyin: "gǔ dào xī fēng shóu mǎ。" },
      { text: "夕阳西下，", pinyin: "xī yáng xī xià，" },
      { text: "断肠人在天涯。", pinyin: "duàn cháng rén zài tiān yá。" },
    ],
    judgementQuestions: [
      "这首小令中的“天净沙”是曲牌名，“秋思”是题目，直接点明了作品的主题。（    ）",
      "“枯”“老”“昏”“古”“瘦”等字眼，体现出羁旅之人心情的郁闷与沉重。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question: "这首小令意象众多，其中      作为整首作品的大背景存在。",
        options: ["A. 老树", "B. 昏鸦", "C. 夕阳", "D. 断肠人"],
        correctIndex: 2,
      },
      {
        question: "下面关于 “古道西风瘦马”理解不正确的是______。",
        options: [
          "A. “古道”点明了游子所处的环境是荒凉冷清。",
          "B. “西风”不仅指自然界的风，也暗含了游子内心的凄凉。",
          "C. “瘦马”既写出了马的样子，也象征着游子的疲惫与艰辛。",
          "D. 虽然笔调略带忧伤，但是却展现了游子的乐观与豁达。",
        ],
        correctIndex: 3,
      },
    ],
  },
  {
    group: "seasonal",
    subGroup: "冬",
    judgementAnsList: [true, false],
    title: "《白雪歌送武判官归京》唐·岑参",
    content:
      "754年左右，岑参怀着建功立业的志向到边疆担任判官。武判官是岑参的前任，岑参在送他回长安的时候，写下了这首诗，本书节录了该诗的前4句。",
    poem: "北风卷地白草折，胡天八月即飞雪。忽如一夜春风来，千树万树梨花开。",
    notes: [
      "1. 判官：中国古代的一种官职。归京：回京城（长安）。",
      "2. 白草：西域一种牧草名，秋天变白色。",
      "3. 胡天：指塞北的天空。",
      "4. 梨花：这里比喻雪花积在树枝上，像梨花开了一样。",
    ],
    lines: [
      { text: "北风卷地白草折，", pinyin: "běi fēng juǎn dì bái cǎo shé，" },
      { text: "胡天八月即飞雪。", pinyin: "hú tiān bā yuè jí fēi xuě。" },
      { text: "忽如一夜春风来，", pinyin: "hū rú yí yè chūn fēng lái，" },
      { text: "千树万树梨花开。", pinyin: "qiān shù wàn shù lí huā kāi。" },
    ],
    judgementQuestions: [
      "岑参是唐朝著名的边塞诗人，他在归京（长安）前创作了这首诗。（    ）",
      "“千树万树梨花开”用夸张的手法描绘了北国春景的美妙。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question:
          "“忽如一夜春风来，千树万树梨花开”这两句诗用       比喻      ，在苦寒中加入了      的色彩。",
        options: [
          "A. 梨花盛开的春景 / 满树雪花的冬景 / 喜悦",
          "B. 梨花盛开的春景 / 满树雪花的冬景 / 浪漫",
          "C. 满树雪花的冬景 / 梨花盛开的春景 / 喜悦",
          "D. 满树雪花的冬景 / 梨花盛开的春景 / 浪漫",
        ],
        correctIndex: 1,
      },
      {
        question:
          "“胡天八月即飞雪”中，_____字写出了边疆气候的不同寻常，也写出诗人的     。",
        options: [
          "A. 即 / 惊奇",
          "B. 即 / 失望",
          "C. 飞 / 惊奇",
          "D. 飞 / 失望",
        ],
        correctIndex: 0,
      },
    ],
  },
  {
    group: "seasonal",
    subGroup: "冬",
    judgementAnsList: [true, false],
    title: "《江雪》唐·柳宗元",
    content:
      "805年永贞革新运动失败，柳宗元因参加革新运动而被贬官到永州，流放10年，过着被管制的生活。政治上的压迫使他倍感孤独，他把人生的价值和理想志趣通过诗歌来加以展现，《江雪》就是他在永州期间的代表作。",
    poem: "千山鸟飞绝，万径人踪灭。孤舟蓑笠翁，独钓寒江雪。",
    notes: [
      "1. 绝：无，没有。",
      "2. 万径：指千万条路。人踪：人的脚印。灭：无，没有。",
      "3. 孤：孤零零。蓑笠：蓑衣和斗笠。",
      "4. 独：独自。",
    ],
    lines: [
      { text: "千山鸟飞绝，", pinyin: "qiān shān niǎo fēi jué，" },
      { text: "万径人踪灭。", pinyin: "wàn jìng rén zōng miè。" },
      { text: "孤舟蓑笠翁，", pinyin: "gū zhōu suō lì wēng，" },
      { text: "独钓寒江雪。", pinyin: "dú diào hán jiāng xuě。" },
    ],
    judgementQuestions: [
      "渔翁形象孤独清高，寄托了诗人的思想情感，是诗人的写照。（    ）",
      "“千山鸟飞绝，万径人踪灭”描绘的是喧嚣热闹的场面。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question: "诗中表现极端寂静的两个字是__________。",
        options: ["A. 飞、踪", "B. 绝、灭", "C. 孤、独", "D. 寒、雪"],
        correctIndex: 1,
      },
      {
        question: "下面对《江雪》艺术特色的描述中，正确的是_______。（可多选）",
        options: [
          "A. 语言简洁，意蕴丰富",
          "B. 将千山万径与孤舟独钓进行对比",
          "C. 描绘了生机勃勃的景象",
          "D. 刻画了不惧风雪、独自垂钓的老渔翁形象",
        ],
        type: "many",
        correctIndics: [0, 1, 3],
      },
    ],
  },
  {
    group: "seasonal",
    subGroup: "冬",
    judgementAnsList: [false, false],
    title: "《问刘十九》唐·白居易",
    content:
      "这首诗是白居易晚年隐居洛阳思念友人刘十九时创作的。刘十九是白居易在江州时的朋友，白居易另有《刘十九同宿》诗，其中说他是“嵩阳刘处士”。",
    poem: "绿蚁新醅酒，红泥小火炉。晚来天欲雪，能饮一杯无？",
    notes: [
      "1. 绿蚁：指漂浮在新酿未过滤的米酒表面的绿色泡沫。醅：酿造。",
      "2. 雪：下雪，这里用作动词。",
      "3. 无：表示疑问的语气词，相当于“么”或“吗”。",
    ],
    lines: [
      { text: "绿蚁新醅酒，", pinyin: "lǜ yǐ xīn pēi jiǔ，" },
      { text: "红泥小火炉。", pinyin: "hòng ní xiǎo huǒ lú。" },
      { text: "晚来天欲雪，", pinyin: "wǎn lái tiān yù xuě，" },
      { text: "能饮一杯无？", pinyin: "néng yǐn yì bēi wú？" },
    ],
    judgementQuestions: [
      "“绿蚁新醅酒”中“绿蚁”的意思是绿色的蚂蚁。（    ）",
      "“能饮一杯无”是在询问对方能不能一下子把一杯酒喝完。（    ）",
    ],
  },
]; */
/* let dataList = [
	        {
           
            group: "nature",
    subGroup: "日与月",
    judgementAnsList: [false, false],
            title : '《暮江吟》唐·白居易',
      content : '822年前后，朝廷政治混乱，诗人白居易请求到京城以外任职，这首诗就作于他外出任职的途中。',
      poem : '一道残阳铺水中，半江瑟瑟半江红。可怜九月初三夜，露似真珠月似弓。',
      notes : [
        '1. 暮江：黄昏时分的江边。',
        '2. 残阳：快要落山的太阳，只能看到一部分，因此说“残”。',
        '3. 瑟瑟：此处指碧绿色。',
        '4. 可怜：可爱。',
        '5. 真珠：珍珠。',
      ],
      lines : [
        { text: '一道残阳铺水中，', pinyin: 'yí dào cán yáng pū shuǐ zhōng，' },
        { text: '半江瑟瑟半江红。', pinyin: 'bàn jiāng sè sè bàn jiāng hóng。' },
        { text: '可怜九月初三夜，', pinyin: 'kě lián jiǔ yuè chū sān yè，' },
        { text: '露似真珠月似弓。', pinyin: 'lù sì zhēn zhū yuè sì gōng。' },
      ],
      judgementQuestions : [
        '诗人用“瑟瑟”“可怜”来表现被贬官后内心的害怕与郁闷。（    ）',
        '“一道残阳铺水中”这句诗中“残阳”的意思是早晨初升的太阳。（    ）'
    ],
    multipleChoiceQuestions : [
        {
            question: '运用色彩对比，描绘江面水波变化的诗句是___________。',
            options: [
                'A. 一道残阳铺水中', 
                'B. 半江瑟瑟半江红', 
                'C. 可怜九月初三夜', 
                'D. 露似真珠月似弓'
            ],
            correctIndex:1
        },
        {
            question: '“可怜九月初三夜，露似真珠月似弓”中“可怜”的意思是         ，诗人用          来比喻           。',
            options: [
                'A. 可爱 / 真珠和弓 / 露水和新月',  
                'B. 可爱 / 露水和新月 / 真珠和弓',   
                'C. 怜悯 / 珠和弓 / 露水和新月', 
                'D. 怜悯 / 露水和新月 / 真珠和弓'
            ],
            correctIndex:0
        }
    ],    
    }
   ,{
      group: "nature",
    subGroup: "日与月",
    judgementAnsList: [false, false],
    title : '《乐游原》唐·李商隐',
      content : '乐游原是唐代长安的游览胜地，因为地理位置高便于览胜，文人墨客经常来这里观赏写诗。这首诗是844年或者845年间，李商隐往来京师的时候路过乐游原有感而作。尽管他有抱负，但是无法施展，仕途很不得志，这首诗就反映了他对于个人前途和国家命运的伤感情绪。',
      poem : '向晚意不适，驱车登古原。夕阳无限好，只是近黄昏。',
      notes : [
        '1. 乐游原：在长安（今西安）城南，是唐代长安城内地势最高地。',
        '2. 向晚：傍晚。意：心情。不适：不悦，不愉快。',
        '3. 驱车：驾车。古原：指乐游原。',
        '4. 无限好：非常好。',
        '5. 近：快要。',
      ],
      lines : [
        { text: '向晚意不适，', pinyin: 'xiàng wǎn yì bú shì，' },
        { text: '驱车登古原。', pinyin: 'qū chē dēng gǔ yuán。' },
        { text: '夕阳无限好，', pinyin: 'xī yáng wú xiàn hǎo，' },
        { text: '只是近黄昏。', pinyin: 'zhǐ shì jìn huáng hūn。' },
      ],
      judgementQuestions : [
        '这首诗是唐代诗人李商隐创作的一首五言律诗。（    ）',
        '“向晚意不适”中的“不适”表明诗人身体不太舒服。（    ）'
    ],
    multipleChoiceQuestions : [
        {
            question: '“向晚意不适”中的“向晚”所指的时间是_______。',
            options: [
                'A. 早晨', 
                'B. 中午', 
                'C. 傍晚', 
                'D. 深夜'
            ],
             correctIndex:2
        },
        {
            question: '“夕阳无限好，只是近黄昏”这两句诗表达了诗人怎样的情感？',
            options: [
                'A. 对夕阳美景的赞叹和留恋',
                'B. 对时光流逝的无奈和感伤',
                'C. 对未来生活的憧憬和期待',
                'D. 对人生价值的深刻反思'
            ],
             correctIndex:1
        }
    ],    
    },
     {
        group: "nature",
    subGroup: "日与月",
    judgementAnsList: [false, true],
        title : '《静夜思》唐·李白',
      content : '《静夜思》是唐代诗人李白创作的一首五言绝句，表达了诗人在静夜思念故乡的深情。',
      poem : '床前明月光，疑是地上霜。举头望明月，低头思故乡。',
      notes : [
        '1. 床前：指床前的地面。',
        '2. 举头：抬头。',
        '3. 思：想念。',
        '4. 故乡：指自己的家乡。',
      ],
      lines : [
        { text: '床前明月光，', pinyin: 'chuáng qián míng yuè guāng,' },
        { text: '疑是地上霜。', pinyin: 'yí shì dì shàng shuāng。' },
        { text: '举头望明月，', pinyin: 'jǔ tóu wàng míng yuè,' },
        { text: '低头思故乡。', pinyin: 'dī tóu sī gù xiāng。' },
      ],
      judgementQuestions : [
        '诗作题目“静夜思”的意思是月夜中静静地思考问题。（    ）',
        '中国古典诗词中，月这个意象常常与思乡的主题联系在一起。（    ）'
    ],
    multipleChoiceQuestions : [
        {
            question: '下面哪一项不是“疑是地上霜”中“霜”字的使用效果？_____',
            options: [
                'A. 写出月光的洁白',
                'B. 表现秋天夜晚的寒意',
                'C. 凸显自然景物的变化',
                'D. 反映诗人飘泊的孤独'
            ],
              correctIndex:2
        },
        {
            question: '“举头望明月，低头思故乡”中的____回应了前一句的“疑”。',
            options: [
                'A. 举', 
                'B. 望', 
                'C. 思', 
                'D. 低'
            ],
              correctIndex:1
        }
    ],    
    },
       {
          group: "nature",
    subGroup: "日与月",
    judgementAnsList: [true, false],
        title : '《水调歌头·明月几时有》宋·苏轼',
      content : '因为与主张变法的王安石等人政见不同，苏轼离开京城到外地做官，1074年赴密州任职，这首词是1076年中秋节他在密州畅饮之后所作。面对一轮明月，想到自己与弟弟苏辙已经分别7年没有团聚了，苏轼感叹之余，写下了这首千古名作。',
      poem : '明月几时有？把酒问青天。不知天上宫阙，今夕是何年。我欲乘风归去，又恐琼楼玉宇，高处不胜寒。起舞弄清影，何似在人间。转朱阁，低绮户，照无眠。不应有恨，何事长向别时圆？人有悲欢离合，月有阴晴圆缺，此事古难全。但愿人长久，千里共婵娟。',
      notes : [
        '1. 丙辰：1076年，这一年苏轼在密州(今山东省诸城市)任太守。',
        '2. 达旦：到天亮。',
        '3. 子由：苏轼的弟弟苏辙的字。',
        '4. 几时：什么时候。',
        '5. 把酒：端起酒杯。',
        '6. 天上宫阙：月亮里的宫殿。在中国的民间传说中，月亮里有一座广寒宫。',
        '7. 归去：回去，指的是去月亮里的宫殿。',
        '8. 琼楼玉宇：指月亮里华美的宫殿。',
        '9. 不胜：经受不住。胜：承担、承受。',
        '10. 起舞弄清影：月光下的身影跟着舞蹈动作做出各种舞姿。',
        '11. 何似：何如，哪里比得上。',
        '12. 朱阁：红色的楼阁。',
        '13. 绮户：装饰华丽的门窗。',
        '14. 何事：为什么。',
        '15. 此事：指人间的“欢”“合”与月亮的“晴”“圆”。',
        '16. 但愿：只希望。',
        '17. 婵娟：指月亮。',
      ],
      lines : [
        { text: '明月几时有？', pinyin: 'míng yuè jǐ shí yǒu？' },
        { text: '把酒问青天。', pinyin: 'bǎ jiǔ wèn qīng tiān。' },
        { text: '不知天上宫阙，', pinyin: 'bú zhī tiān shàng gōng què，' },
        { text: '今夕是何年。', pinyin: 'jīn xī shì hé nián。' },
        { text: '我欲乘风归去，', pinyin: 'wǒ yù chéng fēng guī qù，' },
        { text: '又恐琼楼玉宇，', pinyin: 'yòu kǒng qióng lóu yù yǔ，' },
        { text: '高处不胜寒。', pinyin: 'gāo chù bú shèng hán。' },
        { text: '起舞弄清影，', pinyin: 'qǐ wǔ nòng qīng yǐng，' },
        { text: '何似在人间。', pinyin: 'hé sì zài rén jiān。' },
        { text: '转朱阁，', pinyin: 'zhuǎn zhū gé，' },
        { text: '低绮户，', pinyin: 'dī qǐ hù，' },
        { text: '照无眠。', pinyin: 'zhào wú mián。' },
        { text: '不应有恨，', pinyin: 'bú yīng yǒu hèn，' },
        { text: '何事长向别时圆？', pinyin: 'hé shì chǎng xiàng bié shí yuán？' },
        { text: '人有悲欢离合，', pinyin: 'rén yǒu bēi huān lí hé，' },
        { text: '月有阴晴圆缺，', pinyin: 'yuè yǒu yīn qíng yuán quē，' },
        { text: '此事古难全。', pinyin: 'cǐ shì gǔ nán quán。' },
        { text: '但愿人长久，', pinyin: 'dàn yuàn rén cháng jiǔ，' },
        { text: '千里共婵娟。', pinyin: 'qiān lǐ gòng chán juān。' },
      ],
      judgementQuestions : [
        '表达了对温暖人间的无限眷恋和留下来的决心的词句是“起舞弄清影，何似在人间”。（    ）',
        '“把酒问青天”中的“把酒”的意思是端起酒杯，“高处不胜寒”中的“不胜”的意思是没有超过。（    ）'
    ],
    multipleChoiceQuestions : [
        {
            question: '“我欲乘风归去，又恐琼楼玉宇，高处不胜寒”表达了诗人_____的心理。',
            options: [
                'A. 快乐', 
                'B. 矛盾', 
                'C. 害怕', 
                'D. 忧愁'
            ],
              correctIndex:1
        },
        {
            question: '表达诗人美好祝愿，希望通过共赏明月实现分离之人心灵相聚的诗句是_____________。',
            options: [
                'A. 明月几时有，把酒问青天',      
                'B. 不知天上宫阙，今夕是何年',
                'C. 人有悲欢离合，月有阴晴圆缺', 
                'D. 但愿人长久，千里共婵娟'
            ],
              correctIndex:3
        }
    ],    
    },
        {
           group: "nature",
    subGroup: "云与星",
    judgementAnsList: [true, false],
            title : '《早发白帝城》唐·李白',
      content : '《早发白帝城》是李白创作的一首七言绝句，描写了诗人在清晨乘船离开白帝城的情景，表达了他对自由生活的向往和对大自然的热爱。',
      poem : '朝辞白帝彩云间，千里江陵一日还。两岸猿声啼不住，轻舟已过万重山。',
      notes : [
        '1. 早发：早晨出发。',
        '2. 白帝城：古代位于今重庆市奉节县。',
        '3. 江陵：古代地名，今湖北荆州市。',
        '4. 猿声：指猿猴的叫声。',
      ],
      lines : [
        { text: '朝辞白帝彩云间，', pinyin: 'zhāo cí bái dì cǎi yún jiān,' },
        { text: '千里江陵一日还。', pinyin: 'qiān lǐ jiāng líng yī rì huán。' },
        { text: '两岸猿声啼不住，', pinyin: 'liǎng àn yuán shēng tí bù zhù,' },
        { text: '轻舟已过万重山。', pinyin: 'qīng zhōu yǐ guò wàn zhòng shān。' },
      ],
      judgementQuestions : [
        '这首诗是李白流放夜郎途中得知自己获赦免之后创作的。（    ）',
        '“千里江陵一日还”中“还”的意思是返回，因为江陵是李白的故乡，所以他这样写。（    ）'
    ],
    multipleChoiceQuestions : [
        {
            question: '“千里江陵一日还”中的“千里”和“一日”使用了_______的手法。',
            options: [
                'A. 类比', 
                'B. 拟人', 
                'C. 对比'
            ],
            correctIndex: 2
        },
        {
            question: '“轻舟已过万重山”中为何用“轻舟”？（可多选）______',
            options: [
                'A. 诗人内心情感的寄托与表达。',
                'B. 表明所乘坐的舟很小很轻，舟上人也不多。',
                'C. 表面写舟的轻快，实际上写心情的轻松愉快。'
            ],
            type: "many",
            correctIndics:[0,2]
        }
    ],    
    },
    {
       group: "nature",
    subGroup: "云与星",
    judgementAnsList: [false, true],
  title: '《独坐敬亭台》唐·李白',
      content : '这首诗是李白政途失意后在安徽宣城登临敬亭山时创作的。这一时期的李白饱尝人间辛酸滋味，看透世态炎凉，对现实感到不满，为自己的怀才不遇感到抑郁不平，身心俱疲的诗人内心十分孤寂，需要获得慰藉，创作了不少寄情自然山水、倾诉内心情感的诗篇，《独坐敬亭山》即是其中之一。',
      poem : '众鸟高飞尽，孤云独去闲。相看两不厌，只有敬亭山。',
      notes : [
        '1. 敬亭山：在今安徽宣城北。',
        '2. 尽：没有，消失。',
        '3. 孤云：单独飘浮的云朵，在古代诗词中孤云常被用来象征自由、孤独或超脱世俗的情感，陶渊明《咏贫士》诗中就有“孤云独无依”的句子。闲：形容云朵飘来飘去，悠闲自在的样子。',
        '4. 厌：满足。',
      ],
      lines : [
        { text: '众鸟高飞尽，', pinyin: 'zhòng niǎo gāo fēi jìn，' },
        { text: '孤云独去闲。', pinyin: 'gū yún dú qù xián。' },
        { text: '相看两不厌，', pinyin: 'xiāng kàn liǎng bù yàn，' },
        { text: '只有敬亭山。', pinyin: 'zhǐ yǒu jìng tíng shān。' },
      ],
      judgementQuestions : [
        '这首诗是李白仕途顺利，意气风发的时候创作的。（    ）',
        '诗的后两句写诗人自己和敬亭山互看，这样的描写是将敬亭山拟人化。（    ）'
    ],
    multipleChoiceQuestions : [
        {
            question: '下面“众鸟高飞尽，孤云独去闲”的理解不正确的是_____。',
            options: [
                'A. 写的是诗人一边登敬亭山一边观赏所看见的风景',
                'B. 暗示了诗人在敬亭山游览观望了很长时间',
                'C. 众鸟与孤云是诗人喜悦心情的反映',
                'D. 体现了诗人对大自然的向往与美丽风景的喜爱'
            ],
             type: "many",
            correctIndics:[0,1]
        },
        {
            question: '“相看两不厌，只有敬亭山”这两句诗 _____。（可多选）',
            options: [
                'A. 诗仙李白运用了浪漫主义创作手法',
                'B. 用山的有情来反衬人的无情',
                'C. 以夸张的方式表现出敬亭山给予诗人的慰藉',
                'D. 想象丰富，构思巧妙'
            ],
             type: "many",
            correctIndics:[0,1,3]
        }
    ],    
    }    ,
         {
          group: "nature",
    subGroup: "云与星",
    judgementAnsList: [true, true],
            title : '《迢迢牵牛星》汉·佚名',
      content : '牵牛和织女本是两个星宿的名字，后来演变成牛郎与织女的传说故事，《迢迢牵牛星》就是根据这个传说创作的。这首诗是汉代一首文人五言诗，也是《古诗十九首》之一。《古诗十九首》由南朝萧统从流传下来的无名氏（作者佚名）古诗中，选录十九首编入《文选》而成。',
      poem : '迢迢牵牛星，皎皎河汉女。纤纤擢素手，札札弄机杼。终日不成章，泣涕零如雨。河汉清且浅，相去复几许？盈盈一水间，脉脉不得语。',
      notes : [
        '1. 迢迢：遥远的样子。',
        '2. 皎皎：明亮洁白的样子。',
        '3. 纤纤：细长的样子。擢：伸出。素：洁白。',
        '4. 札札：象声词，机织声。弄：摆弄。杼：织布机上的梭子。',
        '5. 章：布上面的花纹。',
        '6. 泣涕：眼泪。零：落下。',
        '7. 相去：相离，相隔。去：离。复几许：又能有多远。',
        '8. 盈盈：水清澈、晶莹的样子。',
        '9. 脉脉：含情相视的样子。',
      ],
      lines : [
        { text: '迢迢牵牛星，', pinyin: 'tiáo tiáo qiān niú xīng，' },
        { text: '皎皎河汉女。', pinyin: 'jiǎo jiǎo hé hàn nǚ。' },
        { text: '纤纤擢素手，', pinyin: 'xiān xiān zhuó sù shǒu，' },
        { text: '札札弄机杼。', pinyin: 'zhá zhá nòng jī zhù。' },
        { text: '终日不成章，', pinyin: 'zhōng rì bù chéng zhāng，' },
        { text: '泣涕零如雨。', pinyin: 'qì tì líng rú yǔ。' },
        { text: '河汉清且浅，', pinyin: 'hé hàn qīng qiě qiǎn，' },
        { text: '相去复几许？', pinyin: 'xiāng qù fù jǐ xǔ？' },
        { text: '盈盈一水间，', pinyin: 'yíng yíng yì shuǐ jiān，' },
        { text: '脉脉不得语。', pinyin: 'mò mò bù dé yǔ。' },
      ],
      judgementQuestions : [
        '这首诗出自《古诗十九首》，是借用了牛郎织女的神话传说。（    ）',
        '“盈盈一水间，脉脉不得”写出了相隔不远却只能相视无言的悲伤。（    ）'
    ],
    multipleChoiceQuestions : [
        {
            question: '“纤纤”等词语叫做       ，这首诗一共使用了    个这样的词语，它们的使用增强了      。',
            options: [
                'A. 押韵词 / 4 / 画面感',
                'B. 押韵词 / 6 / 音乐美',
                'C. 叠音词 / 4 / 画面感',
                'D. 叠音词 / 6 / 音乐美'
            ],
            correctIndex: 3
        },
        {
            question: '下面关于“终日不成章，泣涕零如雨”理解正确的是_________。（可多选）',
            options: [
                'A. 织女一整天也没织好布上面的花纹。',
                'B. 直白地写出了织女内心的思念之苦',        
                'C. 织女因为思念牛郎，所以织布心不在焉',    
                'D. 织女一整天也没织完一匹布'
            ],
             type: "many",
            correctIndics:[1,2,3]
        }
    ],    
    }
    , {
      group: "nature",
    subGroup: "云与星",
    judgementAnsList: [true, false],
        title : '《夜宿山寺》唐·李白',
      content : '《夜宿山寺》大约创作于725年左右，这个时期李白到处游历，结交朋友，拜谒社会名流，希望得到引荐成为官员，实现政治理想和抱负。这首诗就是李白夜晚留宿江心寺时，发现寺庙后面有一座很高的藏经楼，登上去凭栏远眺后所作，记录了夜游山上高楼的经历。',
      poem : '危楼高百尺，手可摘星辰。不敢高声语，恐惊天上人。',
      notes : [
        '1. 危楼：高楼。百尺：虚指，不是实数，这里形容楼很高。',
        '2. 语：说话。',
        '3. 恐：害怕。惊：惊动。',
      ],
      lines : [
        { text: '危楼高百尺，', pinyin: 'wēi lóu gāo bǎi chǐ，' },
        { text: '手可摘星辰。', pinyin: 'shǒu kě zhāi xīng chén。' },
        { text: '不敢高声语，', pinyin: 'bù gǎn gāo shēng yǔ，' },
        { text: '恐惊天上人。', pinyin: 'kǒng jīng tiān shàng rén。' },
      ],
      judgementQuestions : [
        '这首诗是李白在游览名山大川时，夜宿山间古寺有感而发所作。（    ）',
        '“危楼高百尺”的意思是危险的楼有一百尺那么高。（    ）'
    ],
    multipleChoiceQuestions : [
        {
            question: '对“手可摘星辰”这句诗理解正确的是          。（可多选）',
            options: [
                'A. 写出了寺楼之高',
                'B. 使用了比喻的修辞手法',
                'C. 语言浅显易懂',
                'D. 引发对星空的想象'
            ],
             type: "many",
            correctIndics:[0,2,3]
        },
        {
            question: '“不敢高声语，恐惊天上人”中_____和_____写出了诗人     的心理状态。',
            options: [
                'A. 高声 天上 / 无所顾忌',
                'B. 高声 天上 / 小心翼翼',
                'C. 不敢 恐惊 / 无所顾忌',
                'D. 不敢 恐惊 / 小心翼翼'
            ],
            correctIndex:3
        }
    ],    
    }
   , {
     group: "nature",
    subGroup: "风与雨",
    judgementAnsList: [false, true],
    title : '《秋风引》唐·刘禹锡',
      content : '刘禹锡曾经因为被贬官在南方生活了很长一段时间，这首诗就是创作于这一时期，因秋风起、雁南飞而深受触动，有感思乡之情而作。',
      poem : '何处秋风至？萧萧送雁群。朝来入庭树，孤客最先闻。',
      notes : [
        '1. 引：一种文学或乐曲体裁，有序奏之意，即引子，开头。',
        '2. 至：到。',
        '3. 萧萧：形容风吹树木的声音。',
        '4. 朝：清晨。庭树：庭院里的树木。',
        '5. 孤客：孤独的游子，这里指诗人自己。闻：听到。',
      ],
      lines : [
        { text: '何处秋风至？', pinyin: 'hé chù qiū fēng zhì？' },
        { text: '萧萧送雁群。', pinyin: 'xiāo xiāo sòng yàn qún。' },
        { text: '朝来入庭树，', pinyin: 'zhāo lái rù tíng shù，' },
        { text: '孤客最先闻。', pinyin: 'gū kè zuì xiān wén。' },
      ],
      judgementQuestions : [
        '试题“秋风引”的意思是引用其他作品中关于秋风的描写来写诗。（    ）',
        '这首诗写于诗人被贬官后在南方生活的时期，蕴含了浓浓的思乡之情。（    ）'
    ],
    multipleChoiceQuestions : [
        {
            question: '“萧萧送雁群”所用的创作手法是_________。',
            options: [
                'A. 动静结合', 
                'B. 以乐景写哀情', 
                'C. 视听结合', 
                'D. 侧面烘托'
            ],
            correctIndex: 2
        },
        {
            question: '“朝来入庭树，孤客最先闻”中的_____两字画龙点睛，写出了思乡怀亲之情。',
            options: [
                'A. 朝来', 
                'B. 庭树', 
                'C. 孤客', 
                'D. 最先'
            ],
             correctIndex: 3
        }
    ],    
    },
     {
        group: "nature",
    subGroup: "风与雨",
    judgementAnsList: [false, false],
        title : '《泊船瓜洲》宋·王安石',
      content : '《泊船瓜洲》是宋代诗人王安石创作的一首诗，表达了诗人对家乡的思念之情。',
      poem : '京口瓜洲一水间，钟山只隔数重山。春风又绿江南岸，明月何时照我还。',
      notes : [
        '1. 京口：今江苏省镇江市。',
        '2. 瓜洲：今江苏省扬州市。',
        '3. 绿：吹绿。',
        '4. 钟山：今南京市紫金山。',
      ],
      lines : [
        { text: '京口瓜洲一水间，', pinyin: 'jīng kǒu guā zhōu yī shuǐ jiān,' },
        { text: '钟山只隔数重山。', pinyin: 'zhōng shān zhǐ gé shù zhòng shān。' },
        { text: '春风又绿江南岸，', pinyin: 'chūn fēng yòu lǜ jiāng nán àn,' },
        { text: '明月何时照我还。', pinyin: 'míng yuè hé shí zhào wǒ huán。' },
      ],
      judgementQuestions : [
        '这首诗中“绿”的意思是嫩绿的颜色。（    ）',
        '王安石创作这首诗的目的是表达对朝廷的失望与个人前途的迷茫。（    ）'
    ],
    multipleChoiceQuestions : [
        {
            question: '《泊船瓜洲》使用了__________________的创作手法。',
            options: [
                'A. 托物言志', 
                'B. 色彩对比', 
                'C. 借景抒情', 
                'D. 气氛渲染'
            ],
             correctIndex:2
        },
        {
            question: '下面不属于诗中“绿”字使用效果的是________。',
            options: [
                'A. 寄托了诗人期待一切顺利的愿望',
                'B. 写出了春风的精神',
                'C. 表达了失落的心情',
                'D. 把春风转换成视觉形象'
            ],
            correctIndex:2
        }
    ],    
    }, {
        group: "nature",
    subGroup: "风与雨",
    judgementAnsList: [false, true],
        title : '《春夜喜雨》唐·杜甫',
      content : '《春夜喜雨》是唐代诗人杜甫创作的一首诗，描写了春天夜晚下雨的景象，表现了诗人对春雨的喜爱与赞美之情。',
      poem : '好雨知时节，当春乃发生。随风潜入夜，润物细无声。野径云俱黑，江船火独明。晓看红湿处，花重锦官城。',
      notes : [
        '1. 好雨：及时的雨。',
        '2. 乃：就。',
        '3. 锦官城：成都的别称。',
        '4. 野径：田野的小路。',
      ],
      lines : [
        { text: '好雨知时节，', pinyin: 'hǎo yǔ zhī shí jié,' },
        { text: '当春乃发生。', pinyin: 'dāng chūn nǎi fā shēng。' },
        { text: '随风潜入夜，', pinyin: 'suí fēng qián rù yè,' },
        { text: '润物细无声。', pinyin: 'rùn wù xì wú shēng。' },
        { text: '野径云俱黑，', pinyin: 'yě jìng yún jù hēi,' },
        { text: '江船火独明。', pinyin: 'jiāng chuán huǒ dú míng。' },
        { text: '晓看红湿处，', pinyin: 'xiǎo kàn hóng shī chù,' },
        { text: '花重锦官城。', pinyin: 'huā zhòng jǐn guān chéng。' },
      ],
      judgementQuestions : [
        '“晓看红湿处，花重锦官城”描写的是下雨当天诗人看到雨中繁花盛开的景色。（    ）',
        '“润物细无声”现在常常用来比喻教书育人的时候给学生带来潜移默化的影响。（    ）'
    ],
    multipleChoiceQuestions : [
        {
            question: '“好雨知时节，当春乃发生”中的___字统领全篇，表现出对春雨的赞美。',
            options: [
                'A. 好', 
                'B. 知', 
                'C. 当', 
                'D. 乃'
            ],
            correctIndex:0
        },
        {
            question: '“野径云俱黑，江船火独明”使用了_______的手法描绘了一幅生动的雨中夜景图。',
            options: [
                'A. 借景抒情', 
                'B. 动静结合', 
                'C. 明暗对比', 
                'D. 同色烘托'
            ],
             correctIndex:2
        }
    ],    
    }
    ,{

        group: "nature",
    subGroup: "风与雨",
    judgementAnsList: [true, false],
        title : '《夜雨寄北》唐·李商隐',
      content : '李商隐身在巴蜀的时候，妻子与亲友都在遥远的长安（今陕西省西安市）。秋天的夜雨之中，李商隐的思乡怀亲之情更加浓重，于是创作了这首诗。',
      poem : '君问归期未有期，巴山夜雨涨秋池。何当共剪西窗烛，却话巴山夜雨时。',
      notes : [
        '1. 寄北：写诗寄给北方的人。李商隐当时在巴蜀（现在的四川省），他的妻子与亲友都在长安，所以说“寄北”。',
        '2. 归期：回家的日期。',
        '3. 巴山：这里指的是四川一带。秋池：秋天的池塘。',
        '4. 何当：什么时候。共：一起。共剪西窗烛：意思是一起在西窗下一边剪烛一边谈心。剪烛：剪去燃焦的烛芯，使烛光明亮。“剪烛西窗”用作成语，指思念远方妻子，盼望相聚长谈离别之情，后来泛指亲友相聚畅谈。',
        '5. 却话：回头说，追述。',
      ],
      lines : [
        { text: '君问归期未有期，', pinyin: 'jūn wèn guī qī wèi yǒu qī，' },
        { text: '巴山夜雨涨秋池。', pinyin: 'bā shān yè yǔ zhǎng qiū chí。' },
        { text: '何当共剪西窗烛，', pinyin: 'hé dāng gòng jiǎn xī chuāng zhú，' },
        { text: '却话巴山夜雨时。', pinyin: 'què huà bā shān yè yǔ shí。' },
      ],
      judgementQuestions : [
        '这首诗的前两句反映了离家的诗人在夜里听到秋雨时的孤寂凄凉。（    ）',
        '诗中“共剪西窗烛”描写的是真实发生情景，说明他充分感受到了团聚之时的幸福欢乐。（    ）'
    ],
    multipleChoiceQuestions : [
        {
            question: '下面关于“巴山夜雨涨秋池”正确的理解是___________。（可多选）',
            options: [
                'A. 夜雨使池水涨满，让诗人烦恼',
                'B. 使用了情景交融的创作手法',
                'C. 夜里的秋雨更增加了寒意',
                'D. 夜雨让诗人更加思念远方的妻子'
            ],
              type: 'many',
            correctIndics:[1,2,3]
            
        },
        {
            question: '这首诗采用了________的表现手法，其中___________。',
            options: [
                'A. 虚实结合 / “君问归期未有期”是虚写',
                'B. 虚实结合 / “何当共剪西窗烛”是虚写',
                'C. 今昔对比 / “君问归期未有期”是昔日情景',
                'D. 今昔对比 / “何当共剪西窗烛”是昔日情景'
            ],
            correctIndex:1
        }
    ],    
    } , {
       group: "nature",
    subGroup: "山与水",
    judgementAnsList: [false, false],
        title : '《望岳》唐·杜甫',
      content : '736年，杜甫开始漫游齐、赵、燕、鲁（今河南、河北、山东等地），这首诗就是在途中所作。',
      poem : '岱宗夫如何？齐鲁青未了。造化钟神秀，阴阳割昏晓。荡胸生层云，决眦入归鸟。会当凌绝顶，一览众山小。',
      notes : [
        '1. 岱宗：对泰山的尊称。泰山又名岱山，在今山东省泰安市，古代以泰山为五岳之首，诸山所宗，所以又称“岱宗”。夫：语气词，强调疑问语气。',
        '2. 齐鲁：春秋时期的齐国和鲁国，泰山是两国的分界。青：青翠的山色。未了：没有尽头。',
        '3. 造化：大自然的景物。钟：聚集。神秀：神奇秀美。',
        '4. 阴阳：山北是阴，山南是阳，这里指泰山的山北与山南。割：分割，分开。昏晓：黄昏和清晨。',
        '5. 荡胸：令人胸怀激荡。',
        '6. 决眦：形容极力张大眼睛的样子。眦：眼角。决：裂开。入：收入眼中。',
        '7. 会当：一定要。凌：登上。绝顶：山顶。',
        '8. 小：以……为小，认为……小。',
      ],
      lines : [
        { text: '岱宗夫如何？', pinyin: 'dài zōng fú rú hé？' },
        { text: '齐鲁青未了。', pinyin: 'qí lǔ qīng wèi liǎo。' },
        { text: '造化钟神秀，', pinyin: 'zào huà zhōng shén xiù，' },
        { text: '阴阳割昏晓。', pinyin: 'yīn yáng gē hūn xiǎo。' },
        { text: '荡胸生层云，', pinyin: 'dàng xiōng shēng céng yún，' },
        { text: '决眦入归鸟。', pinyin: 'jué zì rù guī niǎo。' },
        { text: '会当凌绝顶，', pinyin: 'huì dāng líng jué dǐng，' },
        { text: '一览众山小。', pinyin: 'yì lǎn zhòng shān xiǎo。' },
      ],
      judgementQuestions : [
        '“岱宗夫如何？齐鲁青未了”中“岱宗”指的是泰山，这两句诗使用了反问的修辞手法。（    ）',
        '山南是阳，山北是阴，“阴阳”诗中用来指的是泰山的山南与山北。（    ）'
    ],
    multipleChoiceQuestions : [
        {
            question: '________生动地体现了诗人使劲睁大眼睛观赏美景的样子。',
            options: [
                'A. 齐鲁青未了', 
                'B. 造化钟神秀',  
                'C. 荡胸生层云',  
                'D. 决眦入归鸟'
            ],
            correctIndex: 3
        },
        {
            question: '下面关于“阴阳割昏晓”正确的理解是___________。（可多选）',
            options: [
                'A. 表现了泰山的高峻雄伟',
                'B. 在诗人看来泰山好像能主宰天色',
                'C. 细致的近望泰山时候所见',
                'D. 使用了比喻的修辞手法'
            ],
             type: 'many',
            correctIndics:[0,1]
        }
    ],    
    },{
       group: "nature",
    subGroup: "山与水",
    judgementAnsList: [true, false],
        title : '《题西林壁》宋·苏轼',
      content : '宋以前的诗歌传统是以抒情言志为主，到了宋朝出现了以言理为特色的新诗风，这类诗的特点是语浅意深，因物寓理。1084年，苏轼赴汝州时经过九江，与友人一起游览庐山，神奇的山景使他诗兴大发，下了若干首庐山纪游诗，这首借景说理的《题西林壁》就是其中之一。',
      poem : '横看成岭侧成峰，远近高低各不同。不识庐山真面目，只缘身在此山中。',
      notes : [
        '1. 题西林壁：写在西林寺的墙壁上。题：书写，题写。西林：西林寺，庐山上的一座寺庙。',
        '2. 横看：从正面看。',
        '3. 不识：不能认识，辨别。真面目：指庐山真实的景色、形状。',
        '4. 缘：因为，由于。此山：这座山，指庐山。',
      ],
      lines : [
        { text: '横看成岭侧成峰，', pinyin: 'héng kàn chéng lǐng cè chéng fēng，' },
        { text: '远近高低各不同。', pinyin: 'yuǎn jìn gāo dī gè bù tóng。' },
        { text: '不识庐山真面目，', pinyin: 'bù shí lú shān zhēn miàn mù，' },
        { text: '只缘身在此山中。', pinyin: 'zhǐ yuán shēn zài cǐ shān zhōng。' },
      ],
      judgementQuestions : [
        '“题西林壁”的意思是在庐山西林寺的墙壁上书写诗。（    ）',
        '“只缘身在此山中”中的“缘”的意思是缘分。（    ）'
    ],
    multipleChoiceQuestions : [
        {
            question: '这首诗________，既描写了_______，又表达了作者思考以后的感悟。',
            options: [
                'A. 即景说理 / 西林寺风景',
                'B. 即景说理 / 庐山山景',
                'C. 抒情言志 / 西林寺风景',
                'D. 抒情言志 / 庐山山景'
            ],
             correctIndex:1
        },
        {
            question: '下面关于“不识庐山真面目，只缘身在此山中”不正确的理解是_______。',
            options: [
                'A. 因为身在庐山之中，视线被庐山限制，所以才会导致“不识庐山真面目”。',
                'B. 只有在不被群山包围的情况下，才能看出庐山的真正样子。',
                'C. 这是诗人经过自己的细致观察之后，对于庐山风景的客观描写。',
                'D. 观察与认识事物应该客观全面，要突破主观片面的局限。'
            ],
              type: 'many',
            correctIndics:[0,3]
        }
    ],
    }, {
       group: "nature",
    subGroup: "山与水",
    judgementAnsList: [false, true],
        title : '《观沧海》魏·曹操',
      content : '207年，曹操征伐乌桓取得胜利，回程途中他登上秦始皇与汉武帝曾经登过的巨石，心情像沧海一样难以平静，于是写下了这首诗。',
      poem : '东临碣石，以观沧海。水何澹澹，山岛竦峙。树木丛生，百草丰茂。秋风萧瑟，洪波涌起。日月之行，若出其中。星汉灿烂，若出其里。幸甚至哉，歌以咏志。',
      notes : [
        '1. 临：登上。',
        '2. 沧：通“苍”，青绿色。',
        '3. 何：多么。澹澹：水波摇动的样子。',
        '4. 竦峙：高高地挺立。竦：通“耸”，高。',
        '5. 萧瑟：树木被秋风吹的声音。',
        '6. 洪波：巨大的波浪。',
        '7. 若：好像。',
        '8. 星汉：银河。',
        '9. 幸：庆幸。甚：非常。至：极点。',
        '10. 歌：创作诗歌。咏：吟咏，表达。',
      ],
      lines : [
        { text: '东临碣石，以观沧海。', pinyin: 'dōng lín jié shí，yǐ guān cāng hǎi。' },
        { text: '水何澹澹，山岛竦峙。', pinyin: 'shuǐ hé dàn dàn，shān dǎo sǒng zhì。' },
        { text: '树木丛生，百草丰茂。', pinyin: 'shù mù cóng shēng，bǎi cǎo fēng mào。' },
        { text: '秋风萧瑟，洪波涌起。', pinyin: 'qiū fēng xiāo sè，hóng bō yǒng qǐ。' },
        { text: '日月之行，若出其中。', pinyin: 'rì yuè zhī xíng，ruò chū qí zhōng。' },
        { text: '星汉灿烂，若出其里。', pinyin: 'xīng hàn càn làn，ruò chū qí lǐ。' },
        { text: '幸甚至哉，歌以咏志。', pinyin: 'xìng shèn zhì zāi，gē yǐ yǒng zhì。' },
      ],
      judgementQuestions : [
        '《观沧海》表现了诗人在大海边悲秋伤感的心绪。（    ）',
        '“水何澹澹”与“洪波涌起”写出了大海波涛汹涌澎湃的气势。（    ）'
    ],
    multipleChoiceQuestions : [
        {
            question: '“东临碣石，以观沧海”这两句诗_______。',
            options: [
                'A. 交代了观海的时间、地点与人物',
                'B. 描绘了大海无边无际的壮丽景色',
                'C. 点明全诗主旨，以“观”字统领全篇',
                'D. 抒发了诗人建功立业的豪情壮志'
            ],
            correctIndex:0
        },
        {
            question: '下面关于《观沧海》理解不正确的是_______。',
            options: [
                'A. “水何澹澹”与“洪波涌起”写出了大海波涛汹涌澎湃的气势。',
                'B. “山岛竦峙”与“树木丛生，百草丰茂”则是静态的景色。',
                'C. 大海、山岛与树木是虚写，日月、星汉是实写。',
                'D. 全诗意境开阔，气势雄浑，让我们感受到诗人的博大胸襟和远大的政治抱负。'
            ],
             correctIndex:2
        }
    ],    
    }, {
       group: "nature",
    subGroup: "山与水",
    judgementAnsList: [false, false],
        title : '《饮湖上初晴后雨二首（其二）》宋·苏轼',
      content : '1071—1074年苏轼在杭州任职，写下了大量有关西湖的诗，本诗就是其中一首，创作于1073年。苏轼在四大美女中选择西施来比喻西湖，一是西施的家乡在浙江诸暨，离西湖不远；二是西施和西湖，都有个“西”字。',
      poem : '水光潋滟晴方好，山色空蒙雨亦奇。欲把西湖比西子，淡妆浓抹总相宜。',
      notes : [
        '1. 饮湖上：在西湖的船上饮酒。',
        '2. 潋滟：水面波光闪动的样子。方好：正显得美丽。',
        '3. 空蒙：细雨迷濛的样子。亦：也。奇：奇妙。',
        '4. 欲：可以；如果。西子：西施，中国古代四大美女之一。',
        '5. 淡妆浓抹：淡雅和浓艳两种不同的妆饰，诗中用“淡妆”比喻雨天的西湖，“浓抹”比喻晴天的西湖。总相宜：总是很合适。',
      ],
      lines : [
        { text: '水光潋滟晴方好，', pinyin: 'shuǐ guāng liàn yàn qíng fāng hǎo，' },
        { text: '山色空蒙雨亦奇。', pinyin: 'shān sè kōng méng yǔ yì qí。' },
        { text: '欲把西湖比西子，', pinyin: 'yù bǎ xī hú bǐ xī zǐ，' },
        { text: '淡妆浓抹总相宜。', pinyin: 'dàn zhuāng nóng mǒ zǒng xiāng yí。' },
      ],
      judgementQuestions : [
        '“水光潋滟晴方好，山色空蒙雨亦奇”分别描写了晴天和雨日的西湖美景。（    ）',
        '“淡妆浓抹总相宜”描写的是古代四大美人之一西施之美。（    ）'
    ],
    multipleChoiceQuestions : [
        {
            question: '这首诗将_____比作_____，其中“淡妆”比喻_______ “浓抹”比喻_______。',
            options: [
                'A. 西湖 西子 / 雨天的西湖 / 晴天的西湖',
                'B. 西湖 西子 / 晴天的西湖 / 雨天的西湖',
                'C. 西子 西湖 / 雨天的西湖 / 晴天的西湖',
                'D. 西子 西湖 / 晴天的西湖 / 雨天的西湖'
            ],
            correctIndex:2
        },
        {
            question: '下面哪些选项是对仗？（可多选）________',
            options: [
                'A. “水光”与“山色”',
                'B. “空蒙”与“潋滟”',
                'C. “晴方好”与“雨亦奇”',
                'D. “比西子”与“总相宜”'
            ],
              type: 'many',
            correctIndics:[0,1,2]
        }
    ],    
    },
] */
let dataList = [
  {
    group: "emotions",
    subGroup: "怀古、思今与家国情",
    judgementAnsList: [true, true],
    title: "《出塞二首（其一）》唐·王昌龄",
    content:
      "《出塞》是唐代诗人王昌龄创作的一首边塞诗，表达了诗人对将士们征战沙场的同情以及对朝廷的失望之情。",
    poem: "秦时明月汉时关，万里长征人未还。但使龙城飞将在，不教胡马度阴山。",
    notes: [
      "1. 明月：指秦汉时代的月亮。",
      "2. 汉时关：指汉代的边关。",
      "3. 龙城飞将：指汉代名将李广。",
      "4. 阴山：山脉名，指阴山以北的地区。",
    ],
    lines: [
      { text: "秦时明月汉时关，", pinyin: "qín shí míng yuè hàn shí guān," },
      { text: "万里长征人未还。", pinyin: "wàn lǐ cháng zhēng rén wèi huán。" },
      { text: "但使龙城飞将在，", pinyin: "dàn shǐ lóng chéng fēi jiàng zài," },
      { text: "不教胡马度阴山。", pinyin: "bù jiāo hú mǎ dù yīn shān。" },
    ],
    judgementQuestions: [
      "“秦时明月汉时关”暗示着长期以来边疆战争都没有停止过。（    ）",
      "“不教胡马度阴山”写出了不同时代老百姓的共同愿望。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question: "“万里长征人未还”中_____反映了战争给老百姓带来的灾难。",
        options: ["A. 万里", "B. 长征", "C. 人未还"],
		 correctIndex:2
      },
      {
        question: "“秦时明月汉时关”运用了_________的写作手法。",
        options: ["A. 对偶", "B. 互文", "C. 比喻"],
		correctIndex:1
      },
    ],
  },
  {
	 group: "emotions",
    subGroup: "怀古、思今与家国情",
    judgementAnsList: [true, false],
    title: "《乌衣巷》唐·刘禹锡",
    content:
      "826年，刘禹锡返回洛阳途中经过金陵（今江苏南京），写下了一组诗，名为《金陵五题》，这首诗是其中的第二首。",
    poem: "朱雀桥边野草花，乌衣巷口夕阳斜。旧时王谢堂前燕，飞入寻常百姓家。",
    notes: [
      "1. 乌衣巷：晋代王导和谢安两家豪门大族居住的地方，因为两族子弟都喜欢穿乌衣以显身份尊贵，得名“乌衣巷”。",
      "2. 朱雀桥：六朝时秦淮河上有24座浮桥，朱雀桥是最大、最重要的一座，称为“大航”，因为面对都城正南门朱雀门得名。",
      "3. 夕阳斜：夕阳西下。",
      "4. 王谢：王家和谢家，东晋时期非常尊贵显赫的两个家族。",
      "5. 寻常：平常、普通。",
    ],
    lines: [
      { text: "朱雀桥边野草花，", pinyin: "zhū què qiáo biān yě cǎo huā，" },
      { text: "乌衣巷口夕阳斜。", pinyin: "wū yī xiàng kǒu xī yáng xiá。" },
      { text: "旧时王谢堂前燕，", pinyin: "jiù shí wáng xiè táng qián yàn，" },
      { text: "飞入寻常百姓家。", pinyin: "fēi rù xún cháng bǎi xìng jiā。" },
    ],
    judgementQuestions: [
      "这首诗借景抒情，感慨历史的兴衰变化。（    ）",
      "“旧时王谢堂前燕”中的“王谢”是东晋时期的一位知名文人。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question: "下列关于“乌衣巷口夕阳斜”理解不正确的是_______________。",
        options: [
          "A. 写出了景色的动态",
          "B. 描绘了所见迷人风景",
          "C. 营造氛围，增添衰败感",
        ],
		correctIndex:1
      },
      {
        question: "“飞入寻常百姓家”中特别使用“寻常”二字是因为 ____________。",
        options: [
          "A. 强调燕子在乌衣巷很常见",
          "B. “寻常百姓”是一个典故",
          "C. 突出世事沧桑、历史变迁",
        ],
		correctIndex:2
      },
    ],
  },
  {
	 group: "emotions",
    subGroup: "怀古、思今与家国情",
    judgementAnsList: [true, true],
    title: "《春望》唐·杜甫",
    content:
      "《春望》是唐代诗人杜甫创作的一首诗，表达了诗人面对国破家亡的悲愤心情，以及对亲人的深切思念。",
    poem: "国破山河在，城春草木深。感时花溅泪，恨别鸟惊心。烽火连三月，家书抵万金。白头搔更短，浑欲不胜簪。",
    notes: [
      "1. 春望：春天所见的景象。",
      "2. 溅泪：因感动或伤心而流泪。",
      "3. 烽火：战争的火焰。",
      "4. 抵：值得。",
    ],
    lines: [
      { text: "国破山河在，", pinyin: "guó pò shān hé zài," },
      { text: "城春草木深。", pinyin: "chéng chūn cǎo mù shēn。" },
      { text: "感时花溅泪，", pinyin: "gǎn shí huā jiàn lèi," },
      { text: "恨别鸟惊心。", pinyin: "hèn bié niǎo jīng xīn。" },
      { text: "烽火连三月，", pinyin: "fēng huǒ lián sān yuè," },
      { text: "家书抵万金。", pinyin: "jiā shū dǐ wàn jīn。" },
      { text: "白头搔更短，", pinyin: "bái tóu sāo gèng duǎn," },
      { text: "浑欲不胜簪。", pinyin: "hún yù bù shèng zān。" },
    ],
    judgementQuestions: [
      "这首诗描写了安史之乱造成的破坏，抒发了诗人忧国思家的感情。（    ）",
      "诗人通过描写个人形象来反映内心情感的句子是“白头搔更短，浑欲不胜簪”。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question:
          "下面关于“国破山河在，城春草木深”理解正确的是________。（可多选）",
        options: [
          "A. 反映安史之乱后的长安城人烟稀少。",
          "B. 借景抒情，表达了国破家亡的悲哀。",
          "C. 突显了战争给城市所带来的破坏",
          "D. 展示出春天到来的一片大好风景",
        ],
		  type: 'many',
            correctIndics:[0,1,2]
      },
      {
        question: "“家书抵万金”中“万金”运用了______的修辞手法。",
        options: ["A. 比喻", "B. 夸张", "C. 拟人", "D. 类比"],
		correctIndex:1
      },
    ],
  },
  {
	 group: "emotions",
    subGroup: "怀古、思今与家国情",
    judgementAnsList: [true, false],
    title: "《十一月四日风雨大作（其二）》宋·陆游",
    content:
      "陆游出生在北宋灭亡之际，一生的理想就是收复国土、为国家建功立业。这首诗作于1192年，当时陆游68岁，在家乡居住多年，此时的他年迈体衰，在一个风雨大作的夜里，他在梦中实现了自己领兵作战、统一国家的愿望。",
    poem: "僵卧孤村不自哀，尚思为国戍轮台。夜阑卧听风吹雨，铁马冰河入梦来。",
    notes: [
      "1. 僵：僵硬。孤村：孤寂荒凉的村庄。不自哀：不为自己哀伤。",
      "2. 尚：还。思：想着。戍轮台：在新疆一带防守，这里指守卫边疆。",
      "3. 夜阑：夜深。",
      "4. 铁马：披着铁甲的战马。冰河：冰封的河流，指北方地区的河流。",
    ],
    lines: [
      { text: "僵卧孤村不自哀，", pinyin: "jiāng wò gū cūn bú zì āi，" },
      { text: "尚思为国戍轮台。", pinyin: "shàng sī wèi guó shù lún tái。" },
      { text: "夜阑卧听风吹雨，", pinyin: "yè lán wò tīng fēng chuī yǔ，" },
      { text: "铁马冰河入梦来。", pinyin: "tiě mǎ bīng hé rù mèng lái。" },
    ],
    judgementQuestions: [
      "“僵卧孤村”是现实的情况，“为国戍轮台”是心中的理想。（    ）",
      "“夜阑卧听风吹雨”中的“夜阑”的意思是夜晚躺在床上。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question: "__________直接体现了年老体弱的诗人保卫国家的爱国激情。",
        options: [
          "A. 僵卧孤村不自哀",
          "B. 尚思为国戍轮台",
          "C. 夜阑卧听风吹雨",
          "D. 铁马冰河入梦来",
        ],
		correctIndex:1
      },
      {
        question: "下面对这首诗艺术手法的分析正确的是______。",
        options: [
          "A. 以叙事为主，通过讲述自己的生活经历来表达情感。",
          "B. 语言华丽，辞藻堆砌，体现了陆游诗歌的独特风格。",
          "C. “风吹雨”既指自然界的风雨，也象征着国家面临的危难。",
          "D. 运用夸张的手法，描绘了夜里窗外的风雨之大。",
        ],
		correctIndex:2
      },
    ],
  },
    {
		 group: "emotions",
    subGroup: "离别与友情",
    judgementAnsList: [true, false],
    title: "《送元二使安西》唐·王维",
    content:
      "王维的朋友元二奉命出使安西都护府（今新疆），王维在渭城为他送行，写下了这首七绝诗，后来有乐人谱曲，名为“阳关三叠”。",
    poem: "渭城朝雨浥轻尘，客舍青青柳色新。劝君更尽一杯酒，西出阳关无故人。",
    notes: [
      "1. 元二：姓元，排行第二，王维的朋友。",
      "2. 渭城：地名，在今陕西咸阳东北。朝雨：清晨下的雨。浥：湿。",
      "3. 客舍：旅馆。柳色：柳树的色彩。“柳”与“留”谐音，可以表示挽留之意，因此，柳树、柳枝的意象常常出现在古代的送别诗中，离别赠柳表示难分难舍、不忍心分别的心意。",
      "4. 更尽：再喝干，再喝完。",
      "5. 阳关：古代关名，在今甘肃省敦煌西南。",
    ],
    lines: [
      { text: "渭城朝雨浥轻尘，", pinyin: "wèi chéng zhāo yǔ yì qīng chén，" },
      { text: "客舍青青柳色新。", pinyin: "kè shè qīng qīng liǔ sè xīn。" },
      { text: "劝君更尽一杯酒，", pinyin: "quàn jūn gèng jìn yì bēi jiǔ，" },
      { text: "西出阳关无故人。", pinyin: "xī chū yáng guān wú gù rén。" },
    ],
    judgementQuestions: [
      "“客舍青青柳色新”中“柳”与“留”谐音，可以表示挽留之意。（    ）",
      "“西出阳关无故人”中的“故人”指的是已经去世的人。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question: "这首诗特意关联送别主题的两个意象是_______和_______。",
        options: [
          "A. 朝雨  柳树",
          "B. 朝雨  轻尘",
          "C. 客舍  柳树",
          "D. 客舍  轻尘",
        ],
		correctIndex:2
      },
      {
        question: "下面关于“劝君更尽一杯酒”理解正确的是________。（可多选）",
        options: [
          "A. 寄托着深深的惜别之情",
          "B. 酒中包含着不舍、祝福和关心",
          "C. 希望友人能借酒消愁",
          "D. 反映出对前途的担忧",
        ],
		  type: 'many',
            correctIndics:[0,1]
      },
    ],
  },
  {
	 group: "emotions",
    subGroup: "离别与友情",
    judgementAnsList: [false, false],
    title: "《送杜少府之任蜀州》唐·王勃",
    content:
      "《送杜少府之任蜀州》是唐代诗人王勃创作的一首送别诗，表达了诗人对友人的深厚情谊以及对人生的深刻感悟。",
    poem: "城阙辅三秦，风烟望五津。与君离别意，同是宦游人。海内存知己，天涯若比邻。无为在歧路，儿女共沾巾。",
    notes: [
      "1. 城阙：指京城长安。",
      "2. 三秦：指关中地区。",
      "3. 五津：指长江上五个渡口。",
      "4. 宦游：为官而游。",
    ],
    lines: [
      { text: "城阙辅三秦，", pinyin: "chéng què fǔ sān qín," },
      { text: "风烟望五津。", pinyin: "fēng yān wàng wǔ jīn。" },
      { text: "与君离别意，", pinyin: "yǔ jūn lí bié yì," },
      { text: "同是宦游人。", pinyin: "tóng shì huàn yóu rén。" },
      { text: "海内存知己，", pinyin: "hǎi nèi cún zhī jǐ," },
      { text: "天涯若比邻。", pinyin: "tiān yá ruò bǐ lín。" },
      { text: "无为在歧路，", pinyin: "wú wéi zài qí lù," },
      { text: "儿女共沾巾。", pinyin: "ér nǚ gòng zhān jīn。" },
    ],
    judgementQuestions: [
      "“三秦”指秦国附近的三个国家，“五津”指岷江的五个渡口。（    ）",
      "“无为在歧路，儿女共沾巾”充满了离别的伤感，表明诗人因为与友人分别而留下了眼泪。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question:
          "“与君离别意，同是宦游人”理解正确的是_____________。（可多选）",
        options: [
          "A. 表达不得不外出做官的无奈心情",
          "B. 用相同的处境来安慰朋友",
          "C. 增加了朋友的心理负担",
          "D. 将心比心，减轻朋友的孤独感",
        ],
		  type: 'many',
            correctIndics:[1,3]
      },
      {
        question:
          "“海内存知己，天涯若比邻”运用了________修辞手法，表现了诗人的_______，让远行的人能获得_________。",
        options: [
          "A. 拟人 / 乐观豁达 / 昂扬的斗志",
          "B. 拟人 / 悲凉孤独 / 安慰和鼓舞",
          "C. 夸张 / 乐观豁达 / 安慰和鼓舞",
          "D. 夸张 / 悲凉孤独 / 昂扬的斗志",
        ],
		correctIndex:2
      },
    ],
  },

  {
	 group: "emotions",
    subGroup: "离别与友情",
    judgementAnsList: [true, true],
    title: "《黄鹤楼送孟浩然之广陵》唐·李白",
    content:
      "《黄鹤楼送孟浩然之广陵》是唐代诗人李白创作的一首送别诗，表达了诗人对友人的依依惜别之情。",
    poem: "故人西辞黄鹤楼，烟花三月下扬州。孤帆远影碧空尽，唯见长江天际流。",
    notes: [
      "1. 故人：老朋友，指孟浩然。",
      "2. 辞：告别。",
      "3. 烟花：指江南三月的春景。",
      "4. 碧空：蓝天。",
    ],
    lines: [
      { text: "故人西辞黄鹤楼，", pinyin: "gù rén xī cí huáng hè lóu," },
      { text: "烟花三月下扬州。", pinyin: "yān huā sān yuè xià yáng zhōu。" },
      { text: "孤帆远影碧空尽，", pinyin: "gū fān yuǎn yǐng bì kōng jìn," },
      {
        text: "唯见长江天际流。",
        pinyin: "wéi jiàn cháng jiāng tiān jì liú。",
      },
    ],
    judgementQuestions: [
      "送别的地点安排黄鹤楼，营造出诗意浪漫的氛围。（    ）",
      "诗的后两句用诗意的语言描写送别，情景交融。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question: "下面对“烟花三月下扬州”理解正确的是_______。（可多选）",
        options: [
          "A. 用“烟花”比喻扬州迷人的夜景。",
          "B. 扬州的烟花表演非常壮观，孟浩然将前往观赏。",
          "C. 描绘了扬州柳絮如烟、百花鲜艳的春日景象。",
          "D. 表现出诗人对扬州的向往之情。",
        ],
		  type: 'many',
            correctIndics:[2,3]
      },
      {
        question:
          "“孤帆远影碧空尽，唯见长江天际流”形成的画面是_______。（可多选）",
        options: [
          "A. 孤船帆影渐渐消失",
          "B. 诗人在江边目送",
          "C. 长江向天边奔流",
          "D. 江边大浪滔天",
        ],
		  type: 'many',
            correctIndics:[0,1,2]
      },
    ],
  },
      {
		 group: "emotions",
    subGroup: "离别与友情",
    judgementAnsList: [true, false],
	title : '《别董大二首（其一）》唐·高适',
      content : '747年冬天，高适与当时著名的琴师董庭兰相会之后，创作了送别诗《别董大二首》，本诗是第一首。',
      poem : '千里黄云白日曛，北风吹雁雪纷纷。莫愁前路无知己，天下谁人不识君？',
      notes : [
        '1. 董大：一般认为指董庭兰，当时有名的音乐家，在其兄弟中排名第一，所以称为“董大”。',
        '2. 白日曛：太阳昏暗无光。曛：曛黄，夕阳西沉时的昏黄景色。',
        '3. 谁人：哪个人。君：您，指董大。',
      ],
      lines : [
        { text: '千里黄云白日曛，', pinyin: 'qiān lǐ huáng yún bái rì xūn，' },
        { text: '北风吹雁雪纷纷。', pinyin: 'běi fēng chuī yàn xuě fēn fēn。' },
        { text: '莫愁前路无知己，', pinyin: 'mò chóu qián lù wú zhī jǐ，' },
        { text: '天下谁人不识君？', pinyin: 'tiān xià shuí rén bù shí jūn？' },
      ],
      judgementQuestions : [
        '这首诗前两句写景，后两句的抒情，情感由深沉压抑转向高远昂扬。（    ）',
        '“千里黄云白日曛”中“曛”字表现了白天阳光灿烂的样子。（    ）'
    ],
    multipleChoiceQuestions : [
        {
            question: '下面关于 “北风吹雁雪纷纷”理解不正确的是____。',
            options: [
                'A. 描绘了北风中大雪纷飞的景象',
                'B. 烘托了离别时凄凉沉郁的氛围',
                'C. 凸显了冬日天气的复杂多变'
            ],
			correctIndex:2
        },
        {
            question: '“莫愁前路无知己，天下谁人不识君”这两句诗_____。（可多选）',
            options: [
                'A. 使用因果倒置的方式',
                'B. 预言友人的光明前途',
                'C. 鼓励友人踏上前途，迎接未来。'
            ],
			  type: 'many',
            correctIndics:[0,1,2]
        }
    ],    
    },

  {
	 group: "emotions",
    subGroup: "思念与爱情",
    judgementAnsList: [false, false],
    title: "《关雎》周·佚名",
    content:
      "《关雎》是中国古代第一部诗歌总集《诗经》中的一首诗，出自《国风·周南》，是《国风》中的第一篇作品，以雎鸠和荇菜起兴，描写男性对女性的思念与追求。《诗经》分为“风”“雅”“颂”三个部分，“风”就是各地的民歌。“周南”就是周王朝南部的地区。",
    poem: "关关雎鸠，在河之洲。窈窕淑女，君子好逑。参差荇菜，左右流之。窈窕淑女，寤寐求之。求之不得，寤寐思服。悠哉悠哉，辗转反侧。参差荇菜，左右采之。窈窕淑女，琴瑟友之。参差荇菜，左右芼之。窈窕淑女，钟鼓乐之。",
    notes: [
      "1. 关关：象声词，雄、雌雎鸠互相应和鸣叫时发出的声音。",
      "2. 窈窕淑女：贤良美好的女子。窈窕：身材体态美好的样子。",
      "3. 好逑：好的配偶。",
      "4. 参差：长短不齐的样子。",
      "5. 左右流之：时而向左时而向右地摘取荇菜，这里是用摘取荇菜暗喻君子追求淑女。流：同“求”，这里指摘取。",
      "6. 寤寐：醒与睡，也可以说是日与夜。",
      "7. 思服：思念。服：想。",
      "8. 悠哉：意思是思念绵绵不断。",
      "9. 辗转反侧：翻来覆去不能入眠。",
      "10. 芼：摘取，挑选。",
      "11. 钟鼓乐之：敲钟击鼓使她快乐。乐：使……快乐。",
    ],
    lines: [
      {
        text: "关关雎鸠，在河之洲。",
        pinyin: "guān guān jū jiū，zài hé zhī zhōu。",
      },
      {
        text: "窈窕淑女，君子好逑。",
        pinyin: "yǎo tiǎo shū nǚ，jūn zǐ hǎo qiú。",
      },
      {
        text: "参差荇菜，左右流之。",
        pinyin: "cēn cī xìng cài，zuǒ yòu liú zhī。",
      },
      {
        text: "窈窕淑女，寤寐求之。",
        pinyin: "yǎo tiǎo shū nǚ，wù mèi qiú zhī。",
      },
      { text: "求之不得，寤寐思服。", pinyin: "qiú zhī bù dé，wù mèi sī fú。" },
      {
        text: "悠哉悠哉，辗转反侧。",
        pinyin: "yōu zāi yōu zāi，zhǎn zhuǎn fǎn cè。",
      },
      {
        text: "参差荇菜，左右采之。",
        pinyin: "cēn cī xìng cài，zuǒ yòu cǎi zhī。",
      },
      {
        text: "窈窕淑女，琴瑟友之。",
        pinyin: "yǎo tiǎo shū nǚ，qín sè yǒu zhī。",
      },
      {
        text: "参差荇菜，左右芼之。",
        pinyin: "cēn cī xìng cài，zuǒ yòu mào zhī。",
      },
      {
        text: "窈窕淑女，钟鼓乐之。",
        pinyin: "yǎo tiǎo shū nǚ，zhōng gǔ yuè zhī。",
      },
    ],
    judgementQuestions: [
      "“悠哉悠哉”用来形容男子结识心仪的女子之后喜悦的心情。（    ）",
      "“钟鼓乐之”是男子因为思念过度幻想出来的情景。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question:
          "这首诗富于音韵美，其中是_______双声词，________是叠韵词，________是重叠词。",
        options: [
          "A. 关关 / 窈窕 / 参差",
          "B. 关关 / 参差 / 窈窕",
          "C. 参差 / 窈窕 / 关关",
          "D. 参差 / 关关 / 窈窕",
        ],
		correctIndex:3
      },
      {
        question: "下面关于“参差荇菜，左右流之”理解正确的是____。（可多选）",
        options: [
          "A. “左右流之”的意思是时而向左时而向右地摘取荇菜。",
          "B. 诗中用摘取荇菜暗喻君子追求淑女。",
          "C. 说明荇菜随水漂浮，不容易摘取",
          "D. 采荇菜这一行为引出了下文男子对女子的追求与相思",
        ],
		  type: 'many',
            correctIndics:[0,1,3]
      },
    ],
  },
  {
		 group: "emotions",
    subGroup: "思念与爱情",
    judgementAnsList: [true, false],
    title: "《竹枝词二首（其一）》唐·刘禹锡",
    content:
      "822-824年，刘禹锡在夔州任刺史，《竹枝词》是当地一种边舞边唱的民歌，他非常喜欢这种。于是他采用这种民歌的曲子，创作了新的《竹枝词》，描写当地山水风俗和男女爱情，此诗就是其中之一。",
    poem: "杨柳青青江水平，闻郎江上唱歌声。东边日出西边雨，道是无晴还有晴。",
    notes: [
      "1. 竹枝词：乐府曲名，又名“竹枝”“竹枝歌”“竹枝曲”，原是巴渝（今重庆一带）地区的民歌。",
      "2. 晴：谐音“情”。",
    ],
    lines: [
      {
        text: "杨柳青青江水平，",
        pinyin: "yáng liǔ qīng qīng jiāng shuǐ píng，",
      },
      {
        text: "闻郎江上唱歌声。",
        pinyin: "wén láng jiāng shàng chàng gē shēng。",
      },
      { text: "东边日出西边雨，", pinyin: "dōng biān rì chū xī biān yǔ，" },
      { text: "道是无晴还有晴。", pinyin: "dào shì wú qíng hái yǒu qíng。" },
    ],
    judgementQuestions: [
      "这首诗使用起兴手法，描写少女在春日里听到情郎的歌声后的内心活动。（    ）",
      "这首诗采用直抒胸臆的写作手法，直白地表达了少女对江上唱歌少年的爱慕之情。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question: "这首诗主要体现了___________。",
        options: [
          "A. 对自然风光的热爱与赞美",
          "B. 对人生无常的感慨与无奈",
          "C. 对美好爱情的渴望与向往",
          "D. 对社会现实的批判与反思",
        ],
		correctIndex: 2
      },
      {
        question:
          "“道是无晴还有晴”通过________，把天“晴” 和爱“情”巧妙地联系起来。",
        options: ["A. 寓情于景", "B. 谐音双关", "C. 借景抒情", "D. 叠音与双声"],
		correctIndex: 1
      },
    ],
  },
  {
		 group: "emotions",
    subGroup: "思念与爱情",
    judgementAnsList: [true, true],
    title: "《江城子·乙卯正月二十日夜记梦》宋·苏轼",
    content:
      "苏轼19岁时，与16岁的王弗结婚，两人恩爱情深，但是王弗27岁就离开了人世，这对苏轼而言是巨大的打击。1075年正月二十日，身在密州的苏轼梦见亡妻王氏，便写下了这首传诵千古的悼亡词。",
    poem: "十年生死两茫茫，不思量，自难忘。千里孤坟，无处话凄凉。纵使相逢应不识，尘满面，鬓如霜。夜来幽梦忽还乡，小轩窗，正梳妆。相顾无言，惟有泪千行。料得年年肠断处，明月夜，短松冈。",
    notes: [
      "1. 十年：指结发妻子王弗去世已10年。",
      "2. 思量：想念。",
      "3. 千里：指王弗葬地四川眉山与苏轼任所山东密州相隔遥远。孤坟：王弗之墓。",
      "4. 幽梦：隐约的梦境。",
      "5. 小轩窗：指小室的窗前。",
      "6. 顾：看。",
      "7. 料得：想来。",
      "8. 短松：矮松。",
    ],
    lines: [
      {
        text: "十年生死两茫茫，",
        pinyin: "shí nián shēng sǐ liǎng máng máng，",
      },
      { text: "不思量，自难忘。", pinyin: "bú sī liáng，zì nán wàng。" },
      {
        text: "千里孤坟，无处话凄凉。",
        pinyin: "qiān lǐ gū fén，wú chù huà qī liáng。",
      },
      { text: "纵使相逢应不识，", pinyin: "zòng shǐ xiāng féng yīng bú shí，" },
      { text: "尘满面，鬓如霜。", pinyin: "chén mǎn miàn，bìn rú shuāng。" },
      { text: "夜来幽梦忽还乡，", pinyin: "yè lái yōu mèng hū huán xiāng，" },
      {
        text: "小轩窗，正梳妆。",
        pinyin: "xiǎo xuān chuāng，zhèng shū zhuāng。",
      },
      {
        text: "相顾无言，惟有泪千行。",
        pinyin: "xiāng gù wú yán，wéi yǒu lèi qiān háng。",
      },
      {
        text: "料得年年肠断处，",
        pinyin: "liào dé nián nián cháng duàn chù，",
      },
      { text: "明月夜，短松冈。", pinyin: "míng yuè yè，duǎn sōng gāng。" },
    ],
    judgementQuestions: [
      "这首苏轼所作的悼亡词，抒写了对亡妻真挚的爱情和深沉的思念。（    ）",
      "词人通过“不思量，自难忘”这样的表述直接抒了对亡妻的思念之情。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question:
          "“纵使相逢应不识，尘满面，鬓如霜”所用的创作手法是_______，“尘满面，鬓如霜” _________。",
        options: [
          "A. 视听结合 / 表达了对容貌日渐衰老的担忧",
          "B. 视听结合 / 隐含着个人对所经历世事的忧愤",
          "C. 虚实结合 / 隐含着个人对所经历世事的忧愤",
          "D. 虚实结合 / 表达了对容貌日渐衰老的担忧",
        ],
		correctIndex:3
      },
      {
        question:
          "_____________将梦境拉回现实之中，通过设想亡妻的痛苦，来表达深深的悼念之情。",
        options: [
          "A. 十年生死两茫茫，不思量，自难忘",
          "B. 千里孤坟，无处话凄凉",
          "C. 相顾无言，惟有泪千行。",
          "D. 料得年年肠断处，明月夜，短松冈。",
        ],
		correctIndex:3
      },
    ],
  },
  {
		 group: "emotions",
    subGroup: "思念与爱情",
    judgementAnsList: [false, false],
    title: "《一剪梅·红藕香残玉簟秋》宋·李清照",
    content:
      "这首词是李清照的早期作品，大约创作于1103年。1101年李清照与赵明诚结婚，婚后二人恩爱情深，有着许多共同的兴趣爱好。后来李清照的父亲李格非蒙冤，李清照也因此受到牵连，被迫还乡。与丈夫分别期间，她创作了多首词作表达思念之情，《一剪梅》是其中的代表作。",
    poem: "红藕香残玉簟秋，轻解罗裳，独上兰舟。云中谁寄锦书来，雁字回时，月满西楼。花自飘零水自流。一种相思，两处闲愁。此情无计可消除，才下眉头，却上心头。",
    notes: [
      "1. 红藕：粉红色的荷花。玉簟：光滑如玉的竹席。",
      "2. 轻解：轻轻地提起。裳：古人穿的下衣，也泛指衣服。",
      "3. 兰舟：指小船。",
      "4. 锦书：古人将妻子寄给丈夫的信称为锦书，也可以作为书信的美称。",
      "5. 雁字：雁群飞行时，常排列成“人”字或“一”字形，这里用“雁字”指群飞的大雁。",
      "6. 月满西楼：西楼洒满了月光。",
      "7. 飘零：凋谢，凋零。",
      "8. 闲愁：无端无谓的忧愁，指人在闲散无事时的烦恼和忧愁。",
      "9. 无计：没有办法。",
    ],
    lines: [
      { text: "红藕香残玉簟秋，", pinyin: "hóng ǒu xiāng cán yù diàn qiū，" },
      {
        text: "轻解罗裳，独上兰舟。",
        pinyin: "qīng jiě luó cháng，dú shàng lán zhōu。",
      },
      { text: "云中谁寄锦书来，", pinyin: "yún zhōng shuí jì jǐn shū lái，" },
      {
        text: "雁字回时，月满西楼。",
        pinyin: "yàn zì huí shí，yuè mǎn xī lóu。",
      },
      { text: "花自飘零水自流。", pinyin: "huā zì piāo líng shuǐ zì liú。" },
      {
        text: "一种相思，两处闲愁。",
        pinyin: "yì zhǒng xiàng sī，liǎng chù xián chóu。",
      },
      { text: "此情无计可消除，", pinyin: "cǐ qíng wú jì kě xiāo chú，" },
      {
        text: "才下眉头，却上心头。",
        pinyin: "cái xià méi tóu，què shàng xīn tóu。",
      },
    ],
    judgementQuestions: [
      "这首词抒发了夫妻分离两地的相思之苦，词人将深深的思念寄托在红藕、兰舟等意象中。（    ）",
      "“月满西楼”的意思是西楼洒满了月光，以等待时间之长来凸显思念之深。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question:
          "__________通过对词人一举一动的描写，细致地刻画出她不愿惊动他人，只想独自泛舟消愁的心理。",
        options: [
          "A. 雁字回时，月满西楼",
          "B. 一种相思，两处闲愁",
          "C. 轻解罗裳，独上兰舟",
        ],
		correctIndex: 2
      },
      {
        question: "整首词的情感基调是_________。",
        options: ["A. 欢快愉悦", "B. 忧愁哀怨", "C. 激昂慷慨", "D. 淡泊宁静"],
		correctIndex: 1
      },
    ],
  },
  {
	 group: "emotions",
    subGroup: "乡愁与亲情",
    judgementAnsList: [false, false],
    title: "《渡汉江》唐·宋之问",
    content:
      "705年宋之问被贬到岭南做官。当时岭南是边远的地区，环境恶劣，很多贬官到这里的人都没有活着回去。第二年春天他冒险逃回洛阳，这首诗就创作于归途中经过汉江的时候。",
    poem: "岭外音书断，经冬复历春。近乡情更怯，不敢问来人。",
    notes: [
      "1. 岭外：指岭南。音书：（和亲人的）书信联系。",
      "2. 怯：胆怯。",
      "3. 问：询问，打探情况。来人：从故乡那边过来的人。",
    ],
    lines: [
      { text: "岭外音书断，", pinyin: "lǐng wài yīn shū duàn，" },
      { text: "经冬复历春。", pinyin: "jīng dōng fù lì chūn。" },
      { text: "近乡情更怯，", pinyin: "jìn xiāng qíng gèng qiè，" },
      { text: "不敢问来人。", pinyin: "bù gǎn wèn lái rén。" },
    ],
    judgementQuestions: [
      "这首诗表现的是诗人离家前，既思念亲人又不得不远行的矛盾心情。（    ）",
      "“不敢问来人”说明诗人不擅长与人打交道。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question:
          "“岭外音书断，经冬复历春”这两句诗中包含了三重苦，不包括_________。",
        options: [
          "A. 被贬到蛮荒之地",
          "B. 与家人失去联系",
          "C. 身体非常糟糕",
          "D. 经历漫长的分别",
        ],
		correctIndex: 2,
      },
      {
        question:
          "“近乡情更怯，不敢问来人”中“怯”与“不敢”体现的心情是_________。（可多选）",
        options: [
          "A. 想见到家人的急切",
          "B. 不得不回家的无奈",
          "C. 害怕牵连家人的担心",
          "D. 一事无成的失落",
        ],
		  type: 'many',
            correctIndics:[0,2]
      },
    ],
  },
  {
	 group: "emotions",
    subGroup: "乡愁与亲情",
    judgementAnsList: [true, true],
    title: "《杂诗三首（其二）》唐·王维",
    content:
      "安史之乱之后，王维在异乡长时间居住，忽然遇见以前的友人，激起了他强烈的乡思，因此，写下这首诗表达自己对故乡的思念。",
    poem: "君自故乡来，应知故乡事。来日绮窗前，寒梅著花未？",
    notes: [
      "1. 来日：来的时候。绮窗：雕画花纹的窗户。",
      "2. 著花未：开花没有？ 著：通“着”。未：用于句末,表示疑问。",
    ],
    lines: [
      { text: "君自故乡来，", pinyin: "jūn zì gù xiāng lái，" },
      { text: "应知故乡事。", pinyin: "yīng zhī gù xiāng shì。" },
      { text: "来日绮窗前，", pinyin: "lái rì qǐ chuāng qián，" },
      { text: "寒梅著花未？", pinyin: "hán méi zhuó huā wèi？" },
    ],
    judgementQuestions: [
      "这首诗选择了问窗前梅花这样独特的视角来表达对故乡的思念。（    ）",
      "“君自故乡来，应知故乡事”语言浅白，这样的询问接近生活自然状态。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question: "“君自故乡来，应知故乡事”中的“君”指的是________。",
        options: [
          "A. 诗人的好朋友",
          "B. 诗人的亲戚",
          "C. 来看望诗人的人",
          "D. 刚从故乡来的人",
        ],
		correctIndex: 3
      },
      {
        question: "关于诗中“寒梅”这个意象不正确的理解是________。",
        options: [
          "A. 象征着诗人心中的故乡",
          "B. 寄托着诗人对往事的回忆与对亲人的思念",
          "C. 说明诗人非常善于养梅花",
          "D. 含蓄而深厚地表达出思乡的情感",
        ],
		correctIndex: 2
      },
    ],
  },
  {
	 group: "emotions",
    subGroup: "乡愁与亲情",
    judgementAnsList: [true, false],
	
    title: "《月夜忆舍弟》唐·杜甫",
    content:
      "安史之乱中，杜甫的几个弟弟分散在山东、河南一带。由于战争，音信不通，引发了他的深深担心和思念，这首诗就是在这种情境下创作的。",
    poem: "戍鼓断人行，边秋一雁声。露从今夜白，月是故乡明。有弟皆分散，无家问死生。寄书长不达，况乃未休兵。",
    notes: [
      "1. 舍弟：对自己弟弟的谦称。",
      "2. 戍鼓：戍楼上报更的鼓声。古代中国把夜晚分成5个时间段，称为五更，鼓报三更，路上就不准有行人。断人行：指戍鼓声响起后，就开始宵禁。断：断绝。",
      "3. 露从今夜白：意思是今夜正好是白露节气。中国古代在历法之外，还订立一种用来指导农事的补充历法，称为二十四节气，白露就是其中之一，是秋天的第三个节气，从白露开始昼夜温差逐渐拉大。",
      "4. 长：一直，总是。不达：收不到。",
      "5. 况乃：何况是。未休兵：战争还没有结束。",
    ],
    lines: [
      { text: "戍鼓断人行，", pinyin: "shù gǔ duàn rén xíng，" },
      { text: "边秋一雁声。", pinyin: "biān qiū yí yàn shēng。" },
      { text: "露从今夜白，", pinyin: "lù cóng jīn yè bái，" },
      { text: "月是故乡明。", pinyin: "yuè shì gù xiāng míng。" },
      { text: "有弟皆分散，", pinyin: "yǒu dì jiē fēn sàn，" },
      { text: "无家问死生。", pinyin: "wú jiā wèn sǐ shēng。" },
      { text: "寄书长不达，", pinyin: "jì shū cháng bù dá，" },
      { text: "况乃未休兵。", pinyin: "kuàng nǎi wèi xiū bīng。" },
    ],
    judgementQuestions: [
      "“有弟皆分散，无家问死生”由望月转入怀念亲人，饱含对亲人生死的担忧。（    ）",
      "“寄书长不达”意思是家书一直没有写完寄出，所以亲人也无法收到。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question:
          "可以从哪些方面理解“戍鼓断人行，边秋一雁声”。（可多选）______",
        options: [
          "A. 描绘了边塞秋天荒凉的景象",
          "B. 侧面反映战事没有结束",
          "C. 凸显了诗人对边塞风景的喜爱",
          "D. 渲染了月夜悲凉压抑的气氛",
        ],
		  type: 'many',
            correctIndics:[0,1,3]
      },
      {
        question: "下面关于“露从今夜白，月是故乡明”理解不正确的是_______。",
        options: [
          "A. 透露了天气的寒凉",
          "B. 呼应了诗题“月夜”",
          "C. 将故乡的月亮比喻成明珠",
          "D. 采用了寓情于景的创作手法",
        ],
		correctIndex: 2
      },
    ],
  },
  {
	 group: "emotions",
    subGroup: "乡愁与亲情",
    judgementAnsList: [true, true],

    title: "《游子吟》唐·孟郊",
    content:
      "《游子吟》是唐代诗人孟郊创作的一首五言古诗，表达了诗人对母亲深深的思念与感激之情。",
    poem: "慈母手中线，游子身上衣。临行密密缝，意恐迟迟归。谁言寸草心，报得三春晖。",
    notes: [
      "1. 慈母：指慈爱的母亲。",
      "2. 游子：远行的人。",
      "3. 三春晖：指母亲的深恩。",
      "4. 寸草心：比喻子女微薄的报答。",
    ],
    lines: [
      { text: "慈母手中线，", pinyin: "cí mǔ shǒu zhōng xiàn," },
      { text: "游子身上衣。", pinyin: "yóu zǐ shēn shàng yī。" },
      { text: "临行密密缝，", pinyin: "lín xíng mì mì féng," },
      { text: "意恐迟迟归。", pinyin: "yì kǒng chí chí guī。" },
      { text: "谁言寸草心，", pinyin: "shuí yán cùn cǎo xīn," },
      { text: "报得三春晖。", pinyin: "bào dé sān chūn huī。" },
    ],
    judgementQuestions: [
      "这首诗前四句是抒情，后两句转为叙事。（    ）",
      "“临行密密缝，意恐迟迟归”中用“密密”“迟迟”两个叠音词，表现了母亲对孩子的爱与牵挂。（    ）",
    ],
    multipleChoiceQuestions: [
      {
        question: "下列哪一项不是这首诗所表达的主要情感？______",
        options: [
          "A. 赞扬母爱的伟大与无私",
          "B. 体现游子对母亲的感激与思念",
          "C. 批评不孝敬母亲的行为",
          "D. 反映出难以报答母爱的遗憾",
        ],
		correctIndex: 2
      },
      {
        question: "“慈母手中线，游子身上衣”这两句诗主要描绘了___________场景。",
        options: [
          "A. 慈母在田间劳作",
          "B. 游子在外漂泊",
          "C. 慈母为游子缝制衣物",
          "D. 母子共赏春光",
        ],
		correctIndex: 2
      },
    ],
  }
];